["A week after the Washington Interscholastic Activites Association reorganized its sports calendar, it did some fine tuning. Last week, the executive board turned the three-season academic year into four, shorter seasons and moved football to the spring because of the coronavirus pandemic. Tuesday, the WIAA's Executive Board announced a few changes to the plan in the wake of spiking coronavirus cases across the state. • Winter sports, which are in \"Season 2\" of the WIAA's new calendar will start a week earlier (practices begin Dec. 28), so there won't be overlap with Season 3 (which is the new season that contains many of the normal fall sports, including football), which starts competition March 1. • Football practice is scheduled to start Feb. 17, earlier than the other Season 3 sports, as football requires more practices before competition is allowed. • Cross country and slowpitch softball, which are still scheduled for fall (Season 1), have been classific as \"alternate seasons,\" which means they can compete in Season 1 or Season 3. The state championships are moved to Season 3. This is similar to how golf and tennis are contested normally, with some leagues holding the sport in the fall and some in the spring, but the state championships are in the spring. • Girls swimming, which was scheduled for Season 1, has been moved to Season 3. • Since each season this year is shorter by about 30%, schools are capped at scheduling 70% of the contests they normally schedule, which means the 10-week football season will be seven weeks. The opinions expressed in reader comments are those of the author only, and do not reflect the opinions of The Seattle Times. ", "HONOLULU (AP) - The principal of the only school on Lanai thought reopening with full, in-person instruction next month was a no-brainer: The Hawaiian island has had no confirmed coronavirus cases, and breezes flow through many of the school's classrooms. But even there, faculty pushed back, said Lanai High and Elementary School Principal Elton Kinoshita. In the end, only kindergartners and first-graders will meet face to face daily. While Hawaii has one of the lowest rates of cases per capita in the country and many schools have open-air campuses, the challenges of returning kids full time to classrooms may still be insurmountable. Many residents live in multigenerational homes and fear for their elderly relatives, many schools lack the classroom space to allow for desks to be 6 feet (2 meters) apart, and the state is a major tourist destination and could see a rise in cases if restrictions are eased. As a result, most schools in Hawaii will institute the hybrid approach being adopted in many parts of the country, with students alternating between attending in-person classes and online instruction. Some schools will have full face-to-face instruction for younger grade levels, but only a handful of schools will offer a full-time, in-person return. Schools in the only statewide public school system in the nation were scheduled to reopen on Aug. 4, but the teachers union led an effort to delay that. The district and the union agreed to a new date of Aug. 17. The Hawaii Board of Education will consider whether to approve the delay at a meeting Thursday. The union, Hawaii State Teachers Association, doesn't think the district has done sufficient planning for various scenarios, including what happens if someone gets sick or how to pivot to totally remote learning. \"There is a lot of fear among teachers,\" said Corey Rosenlee, union president, noting that about 30% of teachers are at least 50 years old. Older adults and people with existing health problems are at risk of developing more severe illness if infected. As of Tuesday, the state reported around 1,750 confirmed cases and 26 deaths. Teachers are not the only ones who are concerned. Burke Burnett, father of an entering eighth-grader at Kaimuki Middle School in east Honolulu, says many of the school's slatted windows have been shuttered, and the school uses air conditioning. Burnett, a scientist who is pushing for a phased reopening of schools, said he also supports delaying the start of the school year, so the district can conduct assessments of classroom ventilation. Indoor spaces with poor ventilation are generally considered less safe than ones with open windows. Hawaii's status as a premier tourist destination is also raising concerns. The state has been requiring all travelers to self-quarantine for 14 days. Officials planned to allow travelers to bypass the quarantine if they tested negative no more than 72 hours before travel but delayed implementing the plan to focus on reopening schools, said Gov. David Ige, a Democrat. State Epidemiologist Dr. Sarah Park said it's currently safe to start the school year, but she cautioned against letting guards down - even in open-air classrooms. Being outside is helpful, she said, but people still need to maintain distance and wear masks. And she recognized that wouldn't always be easy. \"If anyone's ever sat there in the hot sun in a mask, you feel like you're suffocating,\" said Park, who is also a pediatrician and a mother. A handful schools in Hawaii, like Manoa Elementary in a lush Honolulu valley, are in a prized position and plan to fully return to in-person instruction: The school has generous classroom space, and breezes flow freely through wide-open windows and doors. Lanai High and Elementary School will take advantage of the fact that it sits at an elevation of about 1,500 feet (460 meters), where the morning mist and pine trees cool the campus, allowing most classroom doors and windows to stay open. But the school is stretched for classroom space and so can still only offer limited in-person instruction if desks are to be kept at a proper distance, said Kinoshita, the principal. He would also like to see a delayed start to the year, partly because he's nervous protective equipment shipments will be delayed, particularly desk shields coming from Japan. State Sen. Kurt Fevella, a Republican, is opting for all online classes for his daughter, who will be a junior at the state's largest school, Campbell High, in suburban Honolulu. His daughter, Abigail, is worried about infecting her 80-year-old grandmother, who lives with the family, and how wearing a mask with affect her own asthma. \"I'm kind of afraid that kids will get sick,\" the 16-year-old said. \"My school, we have a lot of kids.\" ", "GUATEMALA CITY (AP) - Guatemalan hospitals say they have had to bury dozens of COVID-19 victims who have never been identified, and one hospital is creating archives in hopes that once the pandemic passes, their relatives will come looking for them. Workers at one of the country's largest public hospitals have started photographing patients who arrive alone and too ill to give their personal details. Those who die unidentified are placed in body bags with transparent windows over the faces in case relatives finally arrive. Protocols that call for rapidly burying the dead during a pandemic only make the situation more difficult, officials say. The government has reported more than 47,000 confirmed infections and more 1,800 deaths nationwide. The first of 63 unidentified dead at the San Juan de Dios Hospital, one of the capital's largest, died April 25 . She was in her 20s and was buried the same day. Byron Fuentes, director of the Public Health Ministry's Public Cemetery Administration, said that so far no one has come forward seeking any of the 41 men and 22 women they have buried, identified only as \"XX.\" The hospital declined to comment on how it handles those who die unidentified. At Roosevelt Hospital, another of Guatemala's largest, Dr. Luis Chávez, head of pathology, said staffers have been looking for ways to help relatives eventually identify the dead. They started using body bags with windows with the hope that relatives arriving any time before burial could identify someone, because for health reasons, the bags can't be opened, Chávez said. \"We had a case some weeks ago of a person who arrived in taxi,\" he said. \"It was a woman. They admitted her to the hospital and she died. She was taken to the morgue as XX.\" He said hospital workers broke protocol to wait two days and fortunately relatives arrived. They were shown a photograph taken through the window in her body bag and identified her, he said. The hospital started using a refrigerated trailer to hold bodies if relatives can't arrive in the six hours the protocols allow for claiming a body after death. No hospitals appear to be taking advantage of a national identity database that contains the fingerprints of anyone with a national identity card. A registry spokeswoman said a search of the National Register of Persons would only be possible with an order from a judge, prosecutors or forensic medicine officials. One death certificate viewed by )The Associated Press showed the person identified only as \"XX XX, XX XX,\" with the gender and an estimated age. For cause of death it listed acute respiratory distress syndrome and COVID-19. For now the unidentified COVID-19 victims are buried in a designated area deep in the capital's Verbena Cemetery. Surrounded by trees and near a settlement of improvised housing, unadorned graves are simply marked with a number. For relatives who may one day seek out their loved ones, there is little to go on. Officials estimate an age, record the gender and the hospital where they arrived. Relatives would have to provide information to match those limited details, said Fuentes, the cemeteries chief. Even then confirmation would be complicated. \"The law establishes that when someone dies from a quarantined illness, they can't be exhumed,\" he said. \"The same law gives us an exception, but it is on a judge's order, the judge would be the one responsible.\" \"Since we stated to bury, we have not received any requests from anyone looking for a relative,\" Fuentes said. ", "PROVIDENCE, R.I. (AP) - As the world races to find a vaccine and a treatment for COVID-19, there is seemingly no antidote in sight for the burgeoning outbreak of coronavirus conspiracy theories, hoaxes, anti-mask myths and sham cures. The phenomenon, unfolding largely on social media, escalated this week when President Donald Trump retweeted a false video about an anti-malaria drug being a cure for the virus and it was revealed that Russian intelligence is spreading disinformation about the crisis through English-language websites. Experts worry the torrent of bad information is dangerously undermining efforts to slow the virus, whose death toll in the U.S. hit 150,000 Wednesday, by far the highest in the world, according to the tally kept by Johns Hopkins University. Over a half-million people have died in the rest of the world. Hard-hit Florida reported 216 deaths, breaking the single-day record it set a day earlier. Texas confirmed 313 additional deaths, pushing its total to 6,190, while South Carolina's death toll passed 1,500 this week, more than doubling over the past month. In Georgia, hospitalizations have more than doubled since July 1. \"It is a real challenge in terms of trying to get the message to the public about what they can really do to protect themselves and what the facts are behind the problem,\" said Michael Osterholm, head of the University of Minnesota's Center for Infectious Disease Research and Policy. He said the fear is that \"people are putting themselves in harm's way because they don't believe the virus is something they have to deal with.\" Rather than fade away in the face of new evidence, the claims have flourished, fed by mixed messages from officials, transmitted by social media, amplified by leaders like Trump and mutating when confronted with contradictory facts. \"You don't need masks. There is a cure,\" Dr. Stella Immanuel promised in a video that promoted hydroxychloroquine. \"You don't need people to be locked down.\" The truth: Federal regulators last month revoked their authorization of the drug as an emergency treatment amid growing evidence it doesn't work and can have deadly side effects. Even if it were effective, it wouldn't negate the need for masks and other measures to contain the outbreak. None of that stopped Trump, who has repeatedly praised the drug, from retweeting the video. Twitter and Facebook began removing the video Monday for violating policies on COVID-19 misinformation, but it had already been seen more than 20 million times. Many of the claims in Immanuel's video are widely disputed by medical experts. She has made even more bizarre pronouncements in the past, saying that cysts, fibroids and some other conditions can be caused by having sex with demons, that McDonald's and Pokemon promote witchcraft, that alien DNA is used in medical treatments, and that half-human \"reptilians\" work in the government. Other baseless theories and hoaxes have alleged that the virus isn't real or that it's a bioweapon created by the U.S. or its adversaries. One hoax  from the outbreak's early months claimed new 5G towers were spreading the virus through microwaves. Another popular story held that Microsoft founder Bill Gates plans to use COVID-19 vaccines to implant microchips  in all 7 billion people on the planet. Then there are the political theories - that doctors, journalists and federal officials are conspiring to lie about the threat of the virus to hurt Trump politically. Social media has amplified the claims and helped believers find each other. The flood of misinformation has posed a challenge for Facebook, Twitter and other platforms, which have found themselves accused of censorship for taking down virus misinformation. More Facebook CEO Mark Zuckerberg was questioned about Immanuel's video during an often-contentious congressional hearing Wednesday. \"We did take it down because it violates our policies,\" Zuckerberg said. U.S. Rep. David Cicilline, a Rhode Island Democrat leading the hearing, responded by noting that 20 million people saw the video before Facebook acted. \"Doesn't that suggest that your platform is so big, that even with the right policies in place, you can't contain deadly content?\" Cicilline asked Zuckerberg. It wasn't the first video containing misinformation about the virus, and experts say it's not likely to be the last. A professionally made 26-minute video that alleges the government's top infectious-disease expert, Dr. Anthony Fauci, manufactured the virus and shipped it to China was watched more than 8 million times before the platforms took action. The video, titled \"Plandemic,\" also warned that masks could make you sick - the false claim Facebook cited when it removed the video down from its site. Judy Mikovits, the discredited doctor behind \"Plandemic,\" had been set to appear on the show \"America This Week\" on the Sinclair Broadcast Group. But the company, which operates TV stations in 81 U.S. markets, canned  the segment, saying it was \"not appropriate\" to air. This week, U.S. government officials speaking on condition of anonymity cited what they said was a clear link between Russian intelligence and websites with stories designed to spread disinformation on the coronavirus in the West. Russian officials rejected the accusations. Of all the bizarre and myriad claims about the virus, those regarding masks are proving to be among the most stubborn. New York City resident Carlos Lopez said he wears a mask when required to do so but doesn't believe it is necessary. \"They're politicizing it as a tool,\" he said. \"I think it's more to try to get Trump to lose. It's more a scare tactic.\" He is in the minority. A recent AP/NORC poll said 3 in 4 Americans - Democrats and Republicans alike - support a national mask mandate. Still, mask skeptics are a vocal minority and have come together to create social media pages where many false claims about mask safety are shared. Facebook has removed some of the pages - such as the group Unmasking America!, which had nearly 10,000 members - but others remain. Early in the pandemic, medical authorities themselves were the source of much confusion regarding masks. In February, officials like the U.S. surgeon general urged Americans not to stockpile masks because they were needed by medical personnel and might not be effective in everyday situations. Public health officials changed their tune when it became apparent that the virus could spread among people showing no symptoms. Yet Trump remained reluctant to use a mask, mocked his rival Joe Biden for wearing one and suggested people might be covering their faces just to hurt him politically. He did an abrupt about-face this month, claiming that he had always supported masks - then later retweeted Immanuel's video against masks. The mixed signals hurt, Fauci acknowledged in an interview with NPR this month. \"The message early on became confusing,\" he said. Many of the claims around masks allege harmful effects, such as blocked oxygen flow or even a greater chance of infection. The claims have been widely debunked by doctors. Dr. Maitiu O Tuathail of Ireland grew so concerned about mask misinformation he posted an online video of himself comfortably wearing a mask while measuring his oxygen levels. The video has been viewed more than 20 million times. \"While face masks don't lower your oxygen levels. COVID definitely does,\" he warned. Yet trusted medical authorities are often being dismissed by those who say requiring people to wear masks is a step toward authoritarianism. \"Unless you make a stand, you will be wearing a mask for the rest of your life,\" tweeted Simon Dolan, a British businessman who has sued the government over its COVID-19 restrictions. Trump's reluctant, ambivalent and late embrace of masks hasn't convinced some of his strongest supporters, who have concocted ever more elaborate theories to explain his change of heart. Some say he was actually speaking in code and doesn't really support masks. O Tuathail witnessed just how unshakable COVID-19 misinformation can be when, after broadcasting his video, he received emails from people who said he cheated or didn't wear the mask long enough to feel the negative effects. That's not surprising, according to University of Central Florida psychology professor Chrysalis Wright, who studies misinformation. She said conspiracy theory believers often engage in mental gymnastics to make their beliefs conform with reality. \"People only want to hear what they already think they know,\" she said. ___ Associated Press writers Beatrice Dupuy in New York, Eric Tucker in Washington, and Amy Forliti in Minneapolis contributed to this report. ", "WASHINGTON (AP) - House Speaker Nancy Pelosi will require that masks be worn on the House floor after a Republican member of Congress tested positive for the coronavirus. The member, Texas Rep. Louie Gohmert, often shunned wearing masks and was known to vote without one. Pelosi announced on the House floor Wednesday evening that all members will be required to wear a mask and one will be provided if they forget. She said failure to wear a mask is a \"serious breach of decorum\" and members could be removed from the chamber if they aren't wearing one. They will be able to temporarily remove them while speaking, however. \"It's a sign of respect for the health, safety and well-being of others present in the chamber and in surrounding areas,\" Pelosi said. Gohmert tested positive just before he was scheduled to travel to his home state with President Donald Trump. He was forced to abruptly cancel his plans, and immediately faced criticism from colleagues for not always wearing a mask on Capitol Hill, where face coverings are not mandatory and testing is sparse. \"A selfish act,\" one lawmaker said. The 66-year-old Gohmert, one of the House's most conservative and outspoken members, told a Texas news station that he tested positive at the White House and planned to self-quarantine. He is at least the 10th member of Congress known to have tested positive for the coronavirus. The congressman's positive test raised further questions about the lack of mask and testing requirements in the Capitol as members frequently fly back and forth from their hometowns and gather for votes, hearings and news conferences. Several GOP senators said they were pushing for more regular testing in the Capitol. \"I think particularly for members of Congress who are going back and forth, they represent sort of the perfect petri dish for how you spread a disease,\" said GOP Sen. Roy Blunt of Missouri, chairman of the Senate Rules Committee. \"You send 535 people out to 535 different locations, on about 1,000 different airplanes, and bring them back and see what happens. It seems to me there's a better path forward.\" An eight-term lawmaker, Gohmert participated in the House Judiciary Committee hearing Tuesday where Attorney General William Barr testified. Before the hearing, Gohmert was seen approaching the meeting room a few feet behind Barr, and neither man was wearing a mask. Gohmert also voted on the House floor Tuesday and attended a House Natural Resources Committee hearing, where a staff member could be seen sitting close behind him on the dais as he talked without a mask. The chairman of that committee, Democratic Rep. Raúl Grijalva of Arizona, announced that he would self-quarantine. \"In the meantime, my work schedule and the lives of my employees are disrupted,\" Grijalva said. \"This stems from a selfish act by Mr. Gohmert, who is just one member of Congress.\" When Gohmert flew to Washington from Texas on Sunday, he sat next to Rep. Kay Granger, R-Texas, who also went into quarantine after learning of her colleague's test results. Mask-wearing is strongly encouraged but not enforced for lawmakers in the Capitol, while other workers and law enforcement officers are required to have on masks. There is no required testing, and lawmakers, reporters and staff often ignore health authorities' advice to stay several feet apart. Pelosi has tried to encourage mask use, and committees have rules requiring the wearing of face coverings in hearing rooms. They still won't be required in hallways or personal offices, which are often cramped. Senate Majority Leader Mitch McConnell, R-Ky., has also pushed the use of masks, and most senators have worn them. But a few have refused, including Kentucky Sen. Rand Paul, a doctor who says it's unnecessary because he previously tested positive for the virus. There is no proven science saying that a person cannot get the virus again. In a television interview, Gohmert said he was given a rapid test by the White House that came back positive, and then took a more thorough test to rule out a false positive. That test came back positive as well, so \"apparently I have it,\" Gohmert told KLTV's East Texas Now. Gohmert, who has questioned mask use for months, also went as far as to say that wearing a mask may have been how he contracted the virus. Medical experts say masks are one of the best ways to prevent transmission of the virus, which is thought to mainly spread through people who are in close contact. After Gohmert tested positive, Justice Department spokeswoman Kerri Kupec said Barr would be tested Wednesday. Gohmert did not wear a mask while questioning Barr, but the seats in the hearing room are spaced many feet away from one another and it is common practice to remove masks during questioning. During the hearing with Barr, the committee chairman, Rep. Jerrold Nadler, D-N.Y., chastised some of Gohmert's GOP colleagues for not wearing masks when they weren't speaking. Nadler did not call out Gohmert by name. In a tweet Wednesday, Nadler said: \"When individuals refuse to take the necessary precautions it puts everyone at risk. I've regularly instructed all members to wear their masks and hope this is a lesson by all my colleagues.\" Another committee Democrat, Washington Rep. Pramila Jayapal, tweeted that lawmakers should \"wear a damn mask!\" \"It's not a joke, not a conspiracy theory, not a game,\" Jayapal said. \"It's serious - it's public health & science. By refusing to consistently wear a mask, Rep. Gohmert & other Republican colleagues have not only put us in harm's way but our staff, families, Capitol workers too.\" Multiple GOP senators said Wednesday they were pushing McConnell to allow expanded testing. McConnell and Pelosi jointly rejected Trump's offer for rapid testing for lawmakers in May, saying they wanted instead to direct resources to front-line workers. That decision has rankled some of their colleagues, including Blunt and Sen. Lamar Alexander, chairman of the Senate Health, Education, Labor and Pensions Committee. Blunt said he believes that lawmakers who are traveling should be tested every time they travel, and that staff and others should be tested occasionally. He said McConnell and the Capitol physician would have to be on board for that to happen, and he doesn't know why they aren't. ___ Associated Press writers Michael Balsamo and Matthew Daly contributed to this report. ", "WASHINGTON (AP) - President Donald Trump on Wednesday dismissed Democratic demands for aid to cash-strapped cities in a new coronavirus  relief package and lashed out at Republican allies as talks stalemated over assistance for millions of Americans. Another lawmaker  tested positive for the virus. Republicans, beset by delays and infighting, signaled a willingness to swiftly approve a modest package to revamp a $600 weekly unemployment benefit that's running out. But House Speaker Nancy Pelosi, D-Calif., roundly rejected that approach as meager, all but forcing Republicans back to the negotiating table. Without action, the aid expires Friday. \"We're nowhere close to the deal,\" said White House chief of staff Mark Meadows. He said they're \"miles apart.\" Stark differences remain between the $3 trillion proposal from Democrats and $1 trillion counter from Republicans, a standoff that is testing Trump and Congress ahead of the November election and putting aid for communities nationwide at risk. Pelosi said the best way to reopen schools and the economy is to defeat the virus, and that can't be done with the \"skinny\" bill Republicans are rushing to cobble together. \"They still don't get it,\" Pelosi said. The virus toll continued to mount in the U.S., with 4.4 million confirmed cases and deaths passing 150,000. Outspoken Rep. Louie Gohmert, R-Texas, who often objects to mask-wearing, became the latest lawmaker at the Capitol to test positive for the virus. Money for states and cites is a crucial dividing line as local governments plead for help to shore up budgets and prevent deeper layoffs as they incur COVID-19 costs and lost tax revenue in shutdown economies. Trump complained about sending \"big bailout money\" to the nation's cities, whose mayors he often criticizes. \"It's a shame to reward badly run radical left Democrats with all of this money they're looking for,\" he said at the White House. Democrats proposed nearly $1 trillion for the local governments, but Trump and Republicans are resisting sending the states and cities more cash. Instead, the GOP offers states flexibility to use $150 billion previously allotted for the virus on other needs. At one point this year, Senate Majority Leader Mitch McConnell, R-Ky., said states could just declare bankruptcy. Governors and mayors who have been urging Congress to help warned that inaction would hit hard. \"If Congress fails to dedicate financial assistance to state and local governments, it will force deep cuts to the very programs workers and families need to get back on their feet,\" said Tara Lee, spokeswoman for Washington Gov. Jay Inslee, a Democrat. Most states have built up reserves since the Great Recession, but the pandemic stopped swaths of the economy in March. Municipal cutbacks and layoffs began. By June, about 1.5 million fewer people were working for governments in the U.S. compared with February, according federal data. More than half the government layoffs have been in education, a sector facing daunting costs as schools prepare to reopen to students. Last month, Moody's Analytics said states were facing a cumulative budget gap of $312 billion over the next two years and local governments would need nearly $200 billion more. Some estimates have calculated the budget gaps as even bigger. \"These are not fancy actions,\" said Democrat Nan Whaley, the mayor of Dayton, Ohio, and vice president of the U.S. Conference of Mayors. \"These are actions around emergency medical providers, fire, police, services the president claims he values.\" It's clear that Democrats are trying to push an advantage in the negotiations because Republicans are so deeply divided over the prospect of big government spending. Trump dismissed the GOP bill as \"semi-irrelevant\" as his team launched talks with Pelosi and Senate Democratic leader Chuck Schumer of New York. McConnell defended his approach as \"serious,\" but he was unable to bring his majority on board. Many Republicans came around to the White House's pitch for a smaller package by Friday. That's when the $600 unemployment benefit  boost as well as a federal eviction moratorium on millions of rental units expire, potentially sending households into devastating turmoil. Speaking at the White House, Trump signaled his interest in reaching a deal and averting an eviction crisis. Treasury Secretary Steven Mnuchin, who is leading the negotiations, said \"the president is very focused\" on unemployment aid and assistance for renters. But the president said his GOP allies should \"go back to school and learn\" after they balked at $1.7 billion for FBI headquarters  in the bill. Trump wants the FBI's central building to remain in Washington, across the street from his Trump International Hotel. McConnell opposed the request as unrelated to virus relief. But Pelosi showed no interest in going small bore on aid. Asked what she thinks of that approach, Pelosi said: \"Nothing. Not even 'not much.' Nothing.\" Republicans propose cutting the $600 weekly unemployment benefit bump to $200 a week as an incentive to push people back to work. On the eviction freeze put in place in March, Democrats proposed extending it, but Republicans did not include it in their bill and Trump hasn't specified what he's wants to do. \"There's no consensus on anything,\" said Sen. John Cornyn, R-Texas. At the Capitol, Pelosi used a zoo metaphor to explain to Mnuchin and Meadows the divide. You see a giraffe, you see a flamingo, Pelosi told the White House team late Tuesday during private talks. These two bills, she said, \"aren't mateable.\" The conversations were relayed by two people who were not authorized to publicly discuss the private session and spoke on condition of anonymity. ___ Associated Press writers Geoff Mulvihill in Cherry Hill, New Jersey; Rachel La Corte in Olympia, Washington; and Jill Colvin, Mary Clare Jalonick and Andrew Taylor in Washington contributed to this report. ", "WASHINGTON (AP) - U.S. officials say Russian intelligence officers are spreading disinformation about the coronavirus pandemic through English-language websites, trying to exploit a crisis that America is struggling to contain before the presidential election in November. Two Russians who have held senior roles in Moscow's military intelligence service known as the GRU have been identified as responsible for a disinformation effort meant to reach American and Western audiences, according to U.S. government officials. They were not authorized to discuss the matter publicly and spoke on condition of anonymity Tuesday. Russian officials on Wednesday rejected the accusations as \"conspiracy theories\" and a \"persistent phobia.\" One of the sites singled out by the U.S. posted a response denouncing as \"categorically false\" the American assertions that it was linked to the Russian military intelligence service or was involved in propaganda. The information had previously been classified, but U.S. officials said it had been downgraded so they could more freely discuss it. Officials said they were doing so now to sound the alarm about the particular websites and to expose what they say is a clear link between the sites and Russian intelligence. Between late May and early July, one of the officials said, the websites published about 150 articles about the pandemic response, including coverage aimed either at propping up Russia or denigrating the U.S. Among the headlines that caught the attention of U.S. officials were \"Russia's Counter COVID-19 Aid to America Advances Case for Détente,\" which suggested that Russia had given urgent and substantial aid to the U.S. to fight the pandemic, and \"Beijing Believes COVID-19 is a Biological Weapon,\" which amplified statements by the Chinese. The spread of disinformation, including by Russia, is an urgent concern heading into the November vote. U.S. officials want to avoid a repeat of the 2016 contest, when a Russian troll farm launched a covert social media campaign to divide American public opinion and to favor then-candidate Donald Trump over Democrat Hillary Clinton. The U.S. government's chief counterintelligence executive warned in a rare public statement Friday about Russia's continued use of internet trolls to advance their goals. The pandemic and race relations and protests across the U.S. have offered fertile territory for misinformation or outfight falsehoods. Trump himself has come under scrutiny for sharing misinformation about a disproved drug for treating the coronavirus in videos that were taken down by Twitter and Facebook. Officials did not say whether the effort behind these particular websites was directly related to the November election, though some of the coverage appeared to denigrate Trump's Democratic challenger, Joe Biden, and called to mind Russian efforts in 2016 to exacerbate race relations in America and spread corruption allegations against U.S. political figures. U.S. officials have warned before about the spread of disinformation tied to the pandemic. But on Tuesday, they went further by singling out a particular information agency that is registered in Russia, InfoRos. It operates a series of websites - InfoRos.ru, Infobrics.org and OneWorld.press - that have leveraged the pandemic to promote anti-Western objectives and to spread disinformation. Officials say the sites promote their narratives in a sophisticated way that they liken to money laundering, where stories in well-written English - and often with pro-Russian sentiment - are cycled through other news sources to conceal their origin and enhance the legitimacy of the information. The sites also amplify stories that originate elsewhere, the government officials said. An email to InfoRos was not immediately returned Tuesday. OneWorld rejected the allegations as \"categorically false\" in a statement posted Wednesday. Kremlin spokesman Dmitry Peskov called the allegations \"some kind of a persistent phobia.\" He said the Russian press was continuing to cover the coronavirus and that there was \"no need need to blame objective and quality work of the media.\" A headline Tuesday on InfoRos.ru about the unrest roiling American cities read \"Chaos in the Blue Cities,\" accompanying a story that lamented how New Yorkers who grew up under the tough-on-crime approach of former Mayors Rudy Giuliani and Michael Bloomberg \"and have zero street smarts\" must now \"adapt to life in high-crime urban areas.\" Another story carried the headline of \"Ukrainian Trap for Biden,\" and claimed that \"Ukrainegate\" - a reference to stories surrounding Biden's son Hunter and his former ties to a Ukraine gas company - \"keeps unfolding with renewed vigor.\" U.S. officials have identified two of the people believed to be behind the sites' operations. The men, Denis Valeryevich Tyurin and Aleksandr Gennadyevich Starunskiy, have previously held leadership roles at InfoRos but have also served in a GRU unit specializing in military psychological intelligence and maintain deep contacts there, the officials said. InfoRos and One World's ties to the Russian state have attracted scrutiny in the past from European disinformation analysts. In 2019, a European Union task force that studies disinformation campaigns identified One World as \"a new addition to the pantheon of Moscow-based disinformation outlets.\" The task force noted that One World's content often parrots the Russian state agenda on issues including the war in Syria. A report published last month by a second, nongovernmental organization, Brussels-based EU DisinfoLab, examined links between InfoRos and One World to Russian military intelligence. The researchers identified technical clues tying their websites to Russia and identified some financial connections between InfoRos and the government. \"InfoRos is evolving in a shady grey zone, where regular information activities are mixed with more controversial actions that could be quite possibly linked to the Russian state's information operations,\" the report's authors concluded. On its English-language Facebook page, InfoRos describes itself as an \"Information agency: world through the eyes of Russia.\" ___ Litvinova reported from Moscow. Associated Press writer David Klepper in Providence, Rhode Island, contributed to this report. ", "Snohomish County's top health official urged school districts to begin the fall term with online learning as coronavirus cases continue to spike across the region. In a letter sent Wednesday to public school superintendents and private school administrators, Snohomish County Health Officer Chris Spitters said given current transmission rates, outbreaks in schools were likely to occur, posing \"substantial additional risk\" to schools and the community. From July 9-22, Snohomish County recorded 89.1 new COVID-19 cases per 100,000 residents, according to data from the Washington State Department of Health. The rate of disease activity has steadily increased from a low of 15.9 cases in early June when the county reopened. RELATED: COVID-19 cases are rising among young adults, but contact tracing them is proving to be difficult Spitters acknowledged health officials know more about containing the coronavirus now than ever before but argued the county has \"negligible\" experience implementing those practices in schools. He feared attempts at in-person learning would fall short of goals of enhanced activities and social supports that come with in-person classes and worried it \"may come at an unacceptable cost in human health.\" Although school-age children aren't typically at high risk for COVID-19, the health district said transmission in schools could amplify transmission in the community. In June, the Office of the Superintendent of Public Instruction released guidance for fall learning, including rules that students and staff wear masks and social distance if in-person classes resume. However, the office is letting school districts determine specific learning models on the local level. RELATED: In-person or remote learning in fall? Check this list for western Washington school districts Most districts in Snohomish County have yet to announce their fall plans, including Everett Public Schools. Earlier this month, Edmonds School District said it would start the year with a hybrid model of remote and in-person classes. Students would learn in-person two days per week and online three days. Notifications can be turned off anytime in the browser settings. ", "Confirmed deaths from the coronavirus in the US have now hit 150,000, which makes it by far the highest death toll in the world according to the tally being kept by Johns Hopkins University. As the world races to find a vaccine and a cure for COVID-19, there is seemingly no antidote in sight for the burgeoning outbreak of coronavirus conspiracy theories, hoaxes, anti-mask myths and sham treatments. The phenomenon, unfolding largely on social media, escalated this week when President Donald Trump retweeted a false video about an anti-malarial drug being a cure for the virus and it was revealed that Russian intelligence is spreading disinformation about the crisis through English-language websites. Experts say the flood of bad information is dangerously undermining efforts to slow the virus, which is now blamed for 150,000 deaths in the U.S. This is a breaking news story and will be updated. Notifications can be turned off anytime in the browser settings. ", "\"Jeopardy!\" and \"Wheel of Fortune\" are set to resume production with a redesign of its sets and other safety measures reflective of what is happening nationwide to fight the coronavirus pandemic. A studio spokesperson confirmed the shows are returning to the studio to tape episodes for the upcoming seasons with some new protocols in place. As part of the changes, the \"Jeopardy!\" stage has been redesigned to allow more space between the contestants. They'll also be kept a safe distance away from host Alex Trebek, who turned 80 last week amid his battle with pancreatic cancer. For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But for some, especially older adults and people with existing health problems, it can cause more severe illness including pneumonia and death. RELATED: Alex Trebek expects to mark 2-year cancer survival in 2021 RELATED: 'Jeopardy!' host Alex Trebek gives health update, previews special vault episodes The \"Wheel of Fortune\" set will include changes to the wheel, allowing more space between contestants. Hosts Pat Sajak, 73, and Vanna White, 63, will also be back. All staff, crew and contestants for both game shows will be tested beforehand, only essential crew will be allowed on stage, everyone behind the scenes will receive personal protective equipment and social distancing will be enforced all around the productions. \"While some things may have changed behind the scenes and on the set to keep everyone safe, fans can expect to see the same 'Wheel of Fortune' and 'Jeopardy!' they have come to love when the season starts,\" a Sony Pictures Television spokesperson said. The shows went on hiatus March 16 due to the pandemic. The Associated Press contributed to this report. Notifications can be turned off anytime in the browser settings. ", "EVERETT, Wash. - Editor's note: The above video aired on KING 5 in May 2020 when Paine Field announced it was suspending service. Commercial flights from Paine Field in Everett are set to resume Saturday with a limited schedule after workers spent more than two months replacing pavement at the airport. Paine Field will offer one daily flight on United Airlines to its Denver hub and two daily flights on Alaska Airlines, one each to Las Vegas and Phoenix. The airport is also known as Snohomish County Airport. Before the coronavirus pandemic reduced air travel, the two airlines served 11 destinations with 24 departures and 24 arrivals on a daily basis. Passenger service was suspended on May 22. Propeller Airports, which operates the passenger terminal, made the announcement with Snohomish County. The company said they decided to temporarily close for planned maintenance and repairs while air travel remained heavily impacted by the pandemic. The airport said maintenance and ramp repair projects were originally scheduled over a four-month period, while passenger service continued, but they decided instead to expedite the work. Propeller Airports built and financed the passenger terminal at Paine Field through a public-private partnership with Snohomish County. The airport opened March 4, 2019, and has served more than 1 million passengers since then. RELATED: Sea-Tac Airport wants TSA to check passengers' temperatures RELATED: Everett's Paine Field suspends passenger service from May 22 to August 1 Notifications can be turned off anytime in the browser settings. ", "SEATTLE - Who doesn't love a good reunion story? Especially if it involves pets and an intercontinental journey. Seattle resident Casey Boulding says her close friend recently told her she was \"happy you're home, but I'm also sorry to see you here.\" It's a pandemic style show of solidarity as Casey is one of many in limbo during the cornavirus pandemic. Casey was about 18 months into her service with the Peace Corps in Morocco when COVID-19 became a global crisis and her organization decided to halt operations and send all volunteers back to the United States. RELATED: Kirkland couple helps community with free store operated from front porch Because the average assignment is 27 months, many Peace Corps volunteers bond with local animals. \"Little know secret, there's a lot of down time in the Peace Corps so companionship with an animal is pretty typical,\" Casey said. When the world changed in mid-March, Casey was sent back to Seattle with little time to make plans for her new kitty companion. RELATED: Shoreline couple brings children's imaginations to life with colorful 'monster zoo' \"I am so thankful for the host families back in Morocco that cared for her while I tried to work out getting her home,\" Casey said Four months passed before Casey learned of cargo planes flying out of Morocco. There were numerous veterinarian and permitting obstacles, but that didn't deter Casey. \"There's only one flight and that's from Casablanca to JFK so I had to fly to New York to meet her at customs,\" Casey said. \"It still feels like a dream that she's here.\" Casey says it's a joyful homecoming of sorts and also rather surreal. \"She reminds me so much of my time in Morocco and yet she's here in my childhood bedroom,\" Casey said. The sign out front of Casey's Seattle home says \"Welcome home baby!\" Notifications can be turned off anytime in the browser settings. ", "Millions of Americans are dealing with the financial fallout of the coronavirus pandemic, including applying for unemployment benefits. Here are answers to some of the top questions our reporters and producers have received from viewers writing in to our new email, money@king5.com. Q: \"Is this week of the last payment with the $600?\" – Robin. A: July 25, 2020, was the last day for the additional $600 in unemployment in Washington state. That means when Washingtonians file for unemployment, they will be filing for last week's work, and that will be the last time they'll receive the extra $600 in benefits. Residents will still receive their regular state unemployment. But, in some cases, some people will be bringing in just $201 a week, which is the minimum amount. The maximum payment is now $844 a week. Some politicians argue that the extra $600 keeps people from going back to work, while others say it's a lifeline for those who struggle with taking care of someone else or who are worried about getting sick. If you are waiting to get approved for benefits, you will get back payments that will include the extra $600. Also, right now you do not have to search for a job while collecting unemployment, but that ends on August 1. Q: \"A lot of people are thinking that the extra $600 a week in unemployment compensation goes through July 31st. Please get the word out that this information is not true.\" - James A: It depends on what state you live in, but in Washington, James is correct. The extra $600 a week in unemployment benefits ends on July 25, 2020. Under the CARES Act, the extra $600 a week in unemployment is scheduled to end on or before July 31, 2020. Since the July 31 falls on a Friday, and because states typically pay out benefits on a weekly cycle that ends on a Saturday or Sunday, it means that the extra payments will likely end on July 25 or July 26. In Washington, the extra $600 in benefits ends on July 25. That means you will not get the additional $600 for the week of July 26 through Saturday, August 1. Some experts believe the federal benefits will be extended, but we don't have any word on that at this time. Once the federal benefits run out, residents will still be eligible for state benefits that max out at $790 a week. However, that is a sharp cut from what people have been getting. Q: Will we be required to report the extra $600 a week added to unemployment on our 2020 tax return? Because a lot of people will be getting more money with these added payments than they would be working.  – Valory A: First, the federal stimulus check is not taxable. However, the extra $600 for federal unemployment is taxed, because unemployment money is considered taxable income. Under the CARES Act, unemployment beneficiaries can receive an extra $600 a week from March 29 to July 25, which works out to $10,200 if you max out the benefit. You can choose to withhold the federal taxes now, and the flat tax rate is 10%. Since there is no state income tax in Washington, that $600 turns into $540. The money also gets reported to the IRS, so you'll get a 1099-G form to fill out for your returns. And since it is taxable income, it could impact any assistance you receive from the government, like a health subsidy. Medicaid and CHIPS recipients are exempt. Q: When these extended benefits end, am I eligible to apply again for other extended benefits? There will be no money coming in and no job. I'm in a high risk group for the workplace. A: Right now it appears there are no extensions to the additional benefits. If you are in need of other resources, here is a helpful list from King County. Q: I hear I can get an extra $600 per week in unemployment. Do I need to do anything extra to get it, and will it run out? A: If you get approved for unemployment, the new Pandemic Unemployment Assistance Program under the CARES Act will give you an extra $600 a week between March 29 and July 25, which is on top of state benefits. No matter when you apply, your pay starts when you lost your job. However, the CARES Act didn't go into effect until late March, so that's as far as you can get retroactive pay for the extra $600. For the most part, applicants don't have to do anything for that extra $600 to start coming in. However, if you are already on unemployment and are about to run out of your benefits, you will have to apply to continue getting benefits for an extra 13 weeks, which was another provision under the CARES Act. \"If you are someone who's been claiming unemployment and have exhausted your benefits, you will need to go back into the system and apply for these extension of benefits for an additional 13 weeks,\" said Nick Demerice, an Employment Security Department spokesperson. \"For most folks who've been affected by the COVID crisis recently and lost their job, this is not an issue yet, but will see down the road.\" That means there's a chance everyone will have to reapply at some point if they run out of their regular benefits before July 25. Washington state also says funding won't run out. This is not a first-come, first-serve situation like with small business loans. Q: \"Is it true that neither any total amount of stimulus or EBT care can be counted as income? Will I be required to report it or show bank statements? I live in low-income housing and DSHS said to ask management.\" – Dee A: The IRS does not consider coronavirus stimulus money as income, so that means you do not have to report it. The stimulus check is an advance on a 2020 tax credit, and even so, it won't reduce the amount of your refund. The stimulus money is not taxable and does not count against you, even if you are receiving unemployment benefits. As for EBT or food assistance, that is also not considered income. On the flipside, collecting unemployment benefits does count as income that could impact your EBT, but that is not what Dee is asking. Q: \"I filed my weekly claims, and they all say pending. I have been waiting to get paid since June 20th. It also says pending $0. I do not know why it says $0 when I am supposed to be getting paid more than that for my claims.\" – Mitchell A: Pending is usually a good sign, but pending with $0 is a letdown. Mitchell was told he needed to talk with a \"Tier 3 Agent,\" however, the state Employment Security Department (ESD) isn't taking incoming calls until July 19. KING 5's Michelle Li decided to go to a panel of people who have dealt with their own unemployment issues during the COVID-19 pandemic. Some of them have been paid, but others have been thrown back into limbo. \"I had a pending zero for several weeks while my Identity needed to be verified,\" said ESD claimant Melaina Valentine. \"So, he might want to look in the pending issues tab to see if there's anything outstanding because that's the only time I've ever seen that.\" \"The zeros don't necessarily mean anything and also it matters if you are looking on your phone or on a computer,\" explained claimant Dawn Nelson. Valentine and Nelson are both very active on social media, whether it's helping people or looking for unemployment answers. Neither of them was expecting it, but they found Facebook has been extremely helpful. Valentine looks at the comments under the ESD posts on Facebook to find her answers, and Nelson uses the \"Washington State Unemployment Support Group\" on Facebook. The group has more than 15,000 members and has a lot of great resources to help find answers. Q: I quit my job mid-March because my peers were given the option to telecommute half their work week, but my boss refused to let me. I felt unsafe. I immediately applied for unemployment benefits on March 16th, and I haven't received a cent! Apparently, I am one of the many people stuck in their \"adjudication\" queues. What about people like me that have been waiting for months? - Aka A: The timeline for clearing adjudication has changed because of imposter fraud. At one point, the state Employment Security Department (ESD) said it would likely clear claims that were in adjudication before May 1 by the end of June. Originally, the agency had hoped for mid-June, but then rampant imposter fraud happened. Nonetheless, it has been an ever-changing goal. The big question is, what happens if your claim is resolved and the claim is denied? The Unemployment Law Project is a nonprofit that helps people with their appeals at no cost. The executive director suggests you ask for an appeal hearing. The issue will likely get resolved before you go before a judge, but if you don't ask for an actual hearing, you may miss an important deadline. Q: The company that I worked for it laid me off on March 26th because of COVID-19 so when I applied for unemployment benefits, they sent me an email that I'm not eligible for the benefits because I didn't work at least 680 hours in 2019. What can I do?  – Amir A: If you first applied before April 18, the short answer is to reapply now, because that's when the state rolled out additional benefits under the CARES Act. Before then, no one received the federal benefits in Washington, because the state hadn't been able to take in applications. It took a while for the state to get federal guidance and update its website. People who didn't previously qualify for regular unemployment now do, including independent contractors and those who worked fewer than 680 hours over the previous year. Everyone on unemployment will also get $600 more a week as well. Q: \"My hours have been reduced at work due to the coronavirus and lack of work. I'm working 24 hours a week now instead of 40 hours per week. Can I get unemployment for the 16 hours I no longer am working? And if I qualify for unemployment, do I get the extra $600?\" – Denise A: The short answer here is yes. You can work part-time and still receive unemployment benefits. Employers who need to stay open but on a less than full-time basis can request a status called \"partial\" for their workers. However, employees must have been hired to work full-time, they have to return to at least one week of full-time employment within four months, and employees must work 16 hours a week. But employers also might want to explore something called the \"SharedWork Program.\" The voluntary program helps employers work with the Employment Security Department (ESD), and they must apply to be a part of the program. Any time an employer reaches out to the ESD, it works with the company to help employees submit claims. The program is cleaner, there is less adjudication when an employee files a claim, and the ESD often does training for the company. The SharedWork Program is also how state employees are allowed to get paid for being furloughed one day a week, which normally would disqualify an employee from receiving unemployment benefits. Businesses need to know about the shared work program, so you might want to ask your employer if they participate. Big companies like Boeing, Alaska Airlines, and REI utilize this program when they are about to do a major layoff or furlough. Q: As a self-employed person collecting pandemic unemployment, how are my benefits affected if I am paid for one day of work by a client? – Lori A: You must report your earnings to the state Employment Security Department (ESD). This could disqualify you from receiving unemployment benefits for the week, or it could make your weekly benefit amount smaller. If you're filing a weekly claim, the ESD will ask if you worked. You have to tell the truth otherwise it is considered fraud. Also, you want to report your earnings for the week in which you earned them, not the week you received payment. You should report the amount before deductions. If you are self-employed, then you should report your net earnings to the ESD. You will also be asked for the total hours or days you earned. You are also supposed to report other earnings like in-kind payments that substitute for money. An example would be free rent for working. Paid vacation, holidays, and sick leave are also considered reportable income. Q: I am 70 and hypertensive (high-risk category). My weekly unemployment claim just began to include a question of whether I'd done three job searches. I'm wondering if now I'm required for some reason to be doing job searches even though I can't go out until August 1st? - Mike A: On June 9, Governor Jay Inslee extended protections to high-risk workers until August 1. During this time, people in this category should have a choice of alternative work assignments, like telework. If that's not feasible, they can use their accrued leave or unemployment benefits, and employers are prohibited from permanently replacing them. Seniors older than 65 or anyone with an underlying health condition are categorized as high-risk. The Employment Security Department (ESD) is easing back into mandatory job search requirements. But as of June 18, the ESD said you do not need to report job search activities until July.  The ESD will share its plan later online and on its social media accounts. When the job search requirements are back in place, the ESD said it would include virtual activities to make it easier for claimants to meet the requirements. Q: We will go back to work on a part-time basis in mid-June. I am hesitant to go back to work because I am still trying to file and collect unemployment from when we were suddenly shut down. If I go back to work, will it jeopardize my claims process?  – David A: When you are approved for unemployment, you get paid for the time you were separated from your job. If you go back to work, you should get paid retroactively for the time you were not working. You can also collect unemployment while working part-time, according to the Washington Employment Security Department. Your benefits will get reduced, but working part-time usually means you can draw benefits longer. Typically applicants must search for work while collecting unemployment, but that requirement was lifted under COVID-19 rules. Q: I'm in an at-risk group due to age, asthma, diabetes – not too excited to get out there too soon but don't want to risk losing the ESD check.  – Bill A: Here's a broad look at some of the options for people who don't feel comfortable going back to work. You will likely be denied regular unemployment unless you have good cause for not going back to work during coronavirus recovery. If you cannot telework, good cause includes being at higher risk for COVID- 19 as defined by the Centers for Disease Control and Prevention, living with or directly caring for a high-risk person or being asked to work at a place that does not follow federal and state guidelines. If you were denied for regular unemployment, you could still be eligible for the federal benefits. Under the Families First Coronavirus Response Act, employees can get two weeks of paid sick leave if they had COVID-19 or must care for someone else in quarantine. Parents can take up to 12 weeks of leave if they can't work because their child's school or day care was closed due to coronavirus. You may also qualify for short-term disability from your company if you had COVID-19, which could provide 26 weeks off with 60-75% of your income. Check your eligibility with the U.S. Department of Labor and reach out to your HR department. Q: \"I was approved for 13 weeks of PEUC after my unemployment benefits were exhausted. When these benefits end, am I eligible to apply again for any other extended benefits?\" – Mary A: The 13 weeks itself was an unemployment benefits extension, paid by the federal government. PEUC stands for \"Pandemic Emergency Unemployment Compensation.\" Aside from that, there are other benefits available. Under the Extended Benefits program, there is an extra 20 weeks of regular unemployment available in Washington state. In order to receive the additional 20 weeks, you had to have run out of your regular unemployment on May 30, 2020, or later. You can apply for the extended benefits two weeks before your PEUC runs out. You should get a letter, and the easiest way to apply is through your e-services account. Normally, there are strict job search requirements to get these extended benefits, but right now, you don't have to do the job search due to the pandemic. RELATED: 'If they are qualified, they'll get it': Unemployment concerns continue during coronavirus SEE MORE: Your Money, Your Future Do you have a question or concern about money during the coronavirus pandemic? Email us at money@king5.com. Notifications can be turned off anytime in the browser settings. ", "Kohl's has announced it will close its stores on Thanksgiving day in 2020 as part of its plans reflecting \"a year like no other.\" Over the past two weeks, a handful of other major retailers said their stores would also be closing on Thanksgiving including Best Buy, Target and Walmart. As part of its announcement, Kohl's said it expects more customers to shop earlier and throughout the season, given the importance of safety surrounding the coronavirus pandemic. In 2019, Kohl's opened its stores at 5 p.m. on Thanksgiving Day to kick-off Black Friday shopping. Kohl's said it plans to offer more information on its holiday hours at a later date. \"The holiday season is when Kohl's shines brightest, and as we move into the holiday season of this very unusual year, we are adapting our plans in response to changing customer expectations and behaviors,\" said Michelle Gass, Kohl's chief executive officer. \"We are deeply appreciative of how our team of Kohl's associates have shown up to serve our customers through this pandemic and know that they will continue to show Kohl's at our best throughout the holidays.\" With fears of a wave of virus cases in the fall, the biggest nightmare would be if retailers had to close down again during the most critical time of the year, analysts said. \"Historically, deal hunting and holiday shopping can mean crowded events, and this isn't a year for crowds,\" Minneapolis-based Target said in a corporate blog post about its Thanksgiving Day plans earlier this week. It said its holiday deals would come earlier than ever - starting in October. Walmart, the nation's largest retailer, announced its move last week. Target opened for the first time on Thanksgiving in 2011, joining other stores in starting Black Friday sales a day early and creating a new tradition of shoppers heading out to the stores after their turkey feast. Many retailers did so because they were trying to better compete with Amazon and other online players. RELATED: Best Buy to close stores on Thanksgiving Day RELATED: Target to close stores on Thanksgiving, dampening Black Friday kickoff RELATED: Walmart plans to close for Thanksgiving given the 'unusual year' But sales ended up eating into Black Friday and many critics lambasted stores for not honoring the holiday and allowing their workers to spend it with family. In response to the backlash and also poor sales, some stores and malls like Bloomington, Minnesota-based Mall of America, reversed course and have not to opened on Thanksgiving in recent years. Costco and Nordstrom among others have always remained closed on Thanksgiving, noting they want to respect the holiday. The bigger question still looms on how to handle Black Friday itself, which also draws huge crowds - and sales. Despite competition from Thanksgiving shopping, Black Friday ranks as either the top or No. 2 sales day of the year. Thanksgiving is not even in the top 10 because sales start around 5 p.m. But the day ranked third in online shopping behind Cyber Monday and Black Friday respectively last year, according to Adobe Analytics, which tracks online sales for 80 of the top 100 retailers. The Associated Press Contributed to this report. Notifications can be turned off anytime in the browser settings. ", "WASHINGTON - As the 2020-21 school year gets closer in Washington state, many school districts are announcing plans for how education will continue in the fall amid the coronavirus pandemic. Below is a list of some of the school districts in western Washington that have announced whether they will be conducting in-person learning, remote learning or a combination of both. Superintendent Dr. Alan Spicciati of the Auburn School District announced the district will start the 2020-21 school year with a full distance learning model. Dr. Spicciati said they are still planning for a return to in-person instruction in a hybrid or full-time model when public health officials advise it is safe, but at that time families will still have the option to continue distance learning. In a letter to parents, Dr. Spicciati said \"We are committed to serving our students with high-quality distance learning. There will be clear expectations, accountability and collaboration for instruction and assignments. We are developing resources and training for staff and families to support the distance learning environment. Students and staff will be held to standards. Grading practices and daily attendance expectations will return. The distance learning will be significantly improved from last spring.\" The superintendent also said distance learning may not fully meet the needs of some students with special needs and English learners, so the district is evaluating how they can provide services to students who need them. The district expects to have more information for parents in the coming weeks. The Bellevue School District announced it will start the 2020-21 school year with remote learning for all families. The district plans to evaluate the remote start for all after the first six weeks of school, said Superintendent Ivan Duran in a letter to families. The district said families that opted to participate in a Hybrid Learning model will begin school in a Temporary Remote Learning model with a plan to move to the Hybrid Learning model when COVID-19 infection rates decrease. There will be no change for families that opted to participate in the Bellevue School District Virtual Learning model for the first semester. The district will be reaching out to families again to confirm their intent to enroll in either the Temporary Remote/Hybrid Learning model or the BSD Virtual Learning model. On July 27, the district will share with families daily remote learning schedules to provide a better understanding of what their child's learning experience will be like. A questionnaire will be going out to families on July 28 with a due date of July 31. The responses will help the district in assigning students to educators and building schedules for middle and high school students, the district said. The BSD will offer limited in-person services to support students and families including childcare, services for students with specific needs and learning support at schools for elementary, middle and high school students. The Central Kitsap School District will begin the year fully remote for \"at least the first nine weeks,\" following the Kitsap Public Health District advising against opening schools for traditional classroom learning. The district has \"developed an improved, more robust remote learning experience that will have increased expectations for student participation, more consistency for delivery of content, and better feedback to students and families.\" The district has plans in place for hybrid learning models, should officials determine it safe for students to return to class. Citing current data and recommendations from Tacoma-Pierce County Health Department Director Dr. Anthony Chen, Clover Park School District will start the year with remote learning. The district has a three-phase plan in place to implement in-person learning, depending on health and safety guidelines: virtual learning, hybrid learning in which students alternate time in school and at home, and in-person learning. Read the full statement from Superintendent Ron Danner here. The Edmonds School District will use a hybrid learning model in the fall that allows students to either split their time between in-person learning and remote learning, or participate in online-only learning. Under the hybrid model, students who are attending in-person classes in the fall will be split into two groups. They will attend classes two days a week and online classes three days a week. In-person classes will be held Mondays, Tuesdays, Thursdays, and Fridays. Wednesdays will be remote learning for everyone, allowing for deep cleaning of buildings. The model was chosen because the district is \"not able to accommodate all students in schools at the same time and also maintain student and staff safety\" when it comes to proper social distancing, among other requirements. Families will also have the option to continue with full-time remote learning. RELATED: Edmonds School District will have mix of remote, in-person learning in fall Federal Way Public Schools will begin the 2020-21 school year with 100% remote learning. The district said if the rate of coronavirus infection diminishes and public health guidelines support returning to in-person classes, the district will transition to a hybrid model of two days of in-person classes and three days of remote learning. In a letter to parents and staff, Superintendent Tammy Campbell promised a \"much more robust, structured, and consistent\" remote learning model than in spring. The district will continue to loan laptops and will implement instructional schedules that alternate elementary, middle and high school classes when possible. Child care will also be offered for special needs students and kindergartners through 5th graders through Right At School. The Kent School District announced that schools will begin the 2020-21 school year with remote learning. The district looked at data from a staff and family survey, as well as guidance from health officials and the district's Back to School Task Force in making the decision to start remotely for the upcoming school year. Remote learning will be consistently provided with more explicit expectations and accountability for instruction and assignments, the district said. Learning opportunities and support for families on the districtwide learning management system, supplemental learning applications, and student-teacher communication platform will also be provided, according to the district. In the coming weeks, the district will be focusing on finalizing its improved remote learning plan, including professional learning for all staff and supports for students, families, and staff. The final version of the plan will be shared with the Kent School Board and posted on the district's website on Aug. 3. Community feedback will be accepted at that time online or via Zoom. The remote learning school year will begin on August 27. RELATED: Kent School District will start with remote learning in the fall The Lake Washington School District will start the 2020-21 school year with a fully remote learning model. \"This decision is being made after a thorough review of available reports and local models.  Additionally, I have spent time discussing the current state of our community and county with the King County Department of Health. Given this and the limited guidance districts have received related to re-opening school in the fall; it was decided to start the school year in a remote model,\" said Superintendent Dr. Jon Holmen in a letter to families. Parents and students can expect to see changes with the upcoming remote learning model including the use of Microsoft Classroom Teams as the sole Learning Management System, synchronous/live instruction balanced through the week and varying by age of the student, daily attendance, typical grading practice and the opportunity for whole and small group experiences. The superintendent said some students will require in-person learning and that will help the district better plan for returning more students to in-person instruction in the future. The district is also still working out how to help families with childcare. More information is expected to be released in August. The Northshore School District will continue with remote learning when classes resume in the fall. The district is using a six-stage approach for people re-entering school. The stages allow educators to pivot between remote learning, a hybrid model, and in-person learning. The stages are determined by the impacts of the current health situation, resources, and direction from state officials. As of July 21, the district was in Stage 2, which means 100 percent remote learning for students. Staff will have \"limited and monitored access\" to schools for planning and delivering instruction. It isn't until Stage 3 when students with the \"greatest need of additional support\" can go to school two days a week for in-person instruction. Each stage adds additional students to a limited number of in-class days until Stage 6, when all students and staff attend in-person class five days a week. RELATED: Students in the Northshore School District will begin year with remote education After \"an extensive review\" of data and updates from the Kitsap Public Health District, officials with the North Kitsap School District decided to begin the school year with remote learning. All students enrolled in the district's hybrid in-person model will also start with remote-only learning. After nine weeks, the district will reassess conditions in Kitsap County, evaluate guidance from state and local officials, \"upon which we will base decisions about how to best serve students.\" Students in the Online Academy will learn remotely for the entire year. North Thurston Public Schools will have a hybrid model of in-person and remote classes. Students will have two days of in-person instruction with \"continuous\" remote learning off-site. Cohorts will rotate between either a Monday/Wednesday or Tuesday/Thursday schedule in-person with priority for families to be on the same schedule. Parents can also choose a 100% remote option if they would like. The Peninsula School District plans to offer 100% in-person classes and remote learning, based on what parents choose. The district cited a parent survey, which found 71% were interested in in-person learning, as one reason for its decision. The plan will be presented to the Peninsula School Board on July 23, and parents can register for classes from July 27 to August 5. The district asks parents to commit to one option for at least one semester or trimester so the district can plan staffing. The Puyallup School District shared the following news with families on July 23: \"The Tacoma-Pierce County Health Department has just announced that based on current levels of COVID-19 in our community, it is not safe to open schools this fall.  Therefore, school will start on Sept. 3 in a full-time Continuous (Distance) Learning model 2.0. At this time, we cannot predict exactly how long we will remain in a full-time distance learning model.  We will continue to rely on public health guidance in monitoring community health and re-analyze our situation 6-8 weeks after school begins Sept. 3.\" The Renton School District announced it plans to start the 2020-21 school year with a fully in-home learning model. \"At this time, we cannot predict how long we will remain in the in-home learning model. However, we will continue to monitor infection rates and rely on public health guidance to determine when we can reopen our school buildings to students,\" said Superintendent Damien Pattenaude. The district said it plans to include more live instruction in its new in-home learning model, small group support and fewer learning platforms. It will also provide all students in grades 6-12 with their own Chromebooks and will provide Chromebooks to any K-5 students who need them. Families that need internet connectivity will also be provided with a hotspot, according to the district. Information on technology distribution will be given to families in the coming weeks. Seattle Public Schools Superintendent Denise Juneau announced the district is recommending a remote learning model for the 2020-21 school year until the risk of COVID-19 transmission decreases enough for in-person learning to resume. In its recommendation, the district plans to provide: The SPS Board of Directors will vote on the superintendent's recommendation and an associated plan for the upcoming school year during its regular board meeting on August 12. The recommendation for remote learning is a shift from the district's previous hybrid plan that included in-person/in-school learning and remote learning. RELATED: Seattle Public Schools superintendent recommends starting school remotely this fall Families in Tacoma can choose to keep their kids at home for 100% remote learning or participate in a hybrid model with a mix of in-person and remote classes. The hybrid model will vary based on grade level. Elementary school Kindergarten through first graders and possibly second graders: Four days of in-person classes a week and one day of distance learning. Third through fifth graders: Two days of in person classes and three days of distance learning. Middle school and high school Two days of in-person classes and three days of distance learning The district will distribute laptops to all high school students starting in August and then will work on plans to give laptops to middle school students and elementary students. The district has ordered laptops for all first through 12th graders, but the laptops are on backorder and could take 150 days to arrive. The Tahoma School District will have 100% remote learning for the first quarter of the school year. In a letter to families and staff, Superintendent Mike Hanson said the district acknowledged in-person learning was most beneficial for students, but said it would be \"very difficult\" to reopen schools in person considering the current COVID-19 transmission rate. The school district says remote learning will be different than the spring, and it plans to use remote learning curriculum from Edgenuity in conjunction with Tahoma curriculum. This list will continue to be updated by KING 5 Staff as more school districts announce plans for the fall. State list of Washington school districts, charter schools, tribal schools, and ESDs Notifications can be turned off anytime in the browser settings. ", "WASHINGTON - U.S. officials say Russian intelligence officers are spreading disinformation about the coronavirus pandemic through English-language websites, trying to exploit a crisis that America is struggling to contain before the presidential election in November. Two Russians who have held senior roles in Moscow's military intelligence service known as the GRU have been identified as responsible for a disinformation effort meant to reach American and Western audiences, according to U.S. government officials. They were not authorized to discuss the matter publicly and spoke on condition of anonymity Tuesday. Russian officials on Wednesday rejected the accusations as \"conspiracy theories\" and a \"persistent phobia.\" One of the sites singled out by the U.S. posted a response denouncing as \"categorically false\" the American assertions that it was linked to the Russian military intelligence service or was involved in propaganda. The information had previously been classified, but U.S. officials said it had been downgraded so they could more freely discuss it. Officials said they were doing so now to sound the alarm about the particular websites and to expose what they say is a clear link between the sites and Russian intelligence. Between late May and early July, one of the officials said, the websites published about 150 articles about the pandemic response, including coverage aimed either at propping up Russia or denigrating the U.S. Among the headlines that caught the attention of U.S. officials were \"Russia's Counter COVID-19 Aid to America Advances Case for Détente,\" which suggested that Russia had given urgent and substantial aid to the U.S. to fight the pandemic, and \"Beijing Believes COVID-19 is a Biological Weapon,\" which amplified statements by the Chinese. RELATED: Russia denies US, UK accusations of weapon test in space RELATED: VERIFY: Yes, a Trump Facebook ad does include a picture from the 2014 Ukraine Revolution The spread of disinformation, including by Russia, is an urgent concern heading into the November vote. U.S. officials want to avoid a repeat of the 2016 contest, when a Russian troll farm launched a covert social media campaign to divide American public opinion and to favor then-candidate Donald Trump over Democrat Hillary Clinton. The U.S. government's chief counterintelligence executive warned in a rare public statement Friday about Russia's continued use of internet trolls to advance their goals. The pandemic and race relations and protests across the U.S. have offered fertile territory for misinformation or outfight falsehoods. Trump himself has come under scrutiny for sharing misinformation about a disproved drug for treating the coronavirus in videos that were taken down by Twitter and Facebook. Officials did not say whether the effort behind these particular websites was directly related to the November election, though some of the coverage appeared to denigrate Trump's Democratic challenger, Joe Biden, and called to mind Russian efforts in 2016 to exacerbate race relations in America and spread corruption allegations against U.S. political figures. U.S. officials have warned before about the spread of disinformation tied to the pandemic. But on Tuesday, they went further by singling out a particular information agency that is registered in Russia, InfoRos. It operates a series of websites - InfoRos.ru, Infobrics.org and OneWorld.press - that have leveraged the pandemic to promote anti-Western objectives and to spread disinformation. Officials say the sites promote their narratives in a sophisticated way that they liken to money laundering, where stories in well-written English - and often with pro-Russian sentiment - are cycled through other news sources to conceal their origin and enhance the legitimacy of the information. The sites also amplify stories that originate elsewhere, the government officials said. An email to InfoRos was not immediately returned Tuesday. OneWorld rejected the allegations as \"categorically false\" in a statement posted Wednesday. Kremlin spokesman Dmitry Peskov called the allegations \"some kind of a persistent phobia.\" He said the Russian press was continuing to cover the coronavirus and that there was \"no need need to blame objective and quality work of the media.\" A headline Tuesday on InfoRos.ru about the unrest roiling American cities read \"Chaos in the Blue Cities,\" accompanying a story that lamented how New Yorkers who grew up under the tough-on-crime approach of former Mayors Rudy Giuliani and Michael Bloomberg \"and have zero street smarts\" must now \"adapt to life in high-crime urban areas.\" Another story carried the headline of \"Ukrainian Trap for Biden,\" and claimed that \"Ukrainegate\" - a reference to stories surrounding Biden's son Hunter and his former ties to a Ukraine gas company - \"keeps unfolding with renewed vigor.\" U.S. officials have identified two of the people believed to be behind the sites' operations. The men, Denis Valeryevich Tyurin and Aleksandr Gennadyevich Starunskiy, have previously held leadership roles at InfoRos but have also served in a GRU unit specializing in military psychological intelligence and maintain deep contacts there, the officials said. RELATED: US accuses Chinese hackers of targeting COVID-19 research RELATED: Report: Hard to prove Russian influence on UK referendum InfoRos and One World's ties to the Russian state have attracted scrutiny in the past from European disinformation analysts. In 2019, a European Union task force that studies disinformation campaigns identified One World as \"a new addition to the pantheon of Moscow-based disinformation outlets.\" The task force noted that One World's content often parrots the Russian state agenda on issues including the war in Syria. A report published last month by a second, nongovernmental organization, Brussels-based EU DisinfoLab, examined links between InfoRos and One World to Russian military intelligence. The researchers identified technical clues tying their websites to Russia and identified some financial connections between InfoRos and the government. \"InfoRos is evolving in a shady grey zone, where regular information activities are mixed with more controversial actions that could be quite possibly linked to the Russian state's information operations,\" the report's authors concluded. On its English-language Facebook page, InfoRos describes itself as an \"Information agency: world through the eyes of Russia.\" ___ Litvinova reported from Moscow. Associated Press writer David Klepper in Providence, Rhode Island, contributed to this report. Notifications can be turned off anytime in the browser settings. ", "Amid the chaos of the pandemic's early days, doctors who faced the first coronavirus onslaught reached across oceans and language barriers in an unprecedented effort to advise colleagues trying to save lives in the dark. With no playbook to follow and no time to wait for research, YouTube videos describing autopsy findings and X-rays swapped on Twitter and WhatsApp spontaneously filled the gap. When Stephen Donelson arrived at the University of Texas Southwestern Medical Center in mid-March, Dr. Kristina Goff was among those who turned to what she called \"the stories out of other places that were hit before.\" Donelson's family hadn't left the house in two weeks after COVID-19 started spreading in Texas, hoping to shield the organ transplant recipient. Yet one night, his wife found him barely breathing, his skin turning blue, and called 911. In New York or Italy, where hospitals were overflowing, Goff thinks Donelson wouldn't even have qualified for a then-precious ventilator. But in Dallas, \"we pretty much threw everything we could at him,\" she said. Like doctors everywhere, Goff was at the beginning of a huge and daunting learning curve. RELATED: US hits 6 months since first reported COVID-19 case RELATED: US officials: Russia behind spread of coronavirus disinformation \"It's a tsunami. Something that if you don't experience it directly, you can't understand,\" Italian Dr. Pier Giorgio Villani said in a series of webinars on six straight Tuesday evenings to alert other intensive care units what to expect. They started just two weeks after Italy's first hospitalized patient arrived in his ICU, and 10 days before Donelson fell ill in Texas. Villani, who works in the northern city of Lodi, described a battle to accommodate the constant flow of people needing breathing tubes. \"We had 10, 12, 15 patients to intubate and an ICU with seven patients already intubated,\" he said. The video sessions, organized by an Italian association of ICUs, GiViTI, and the non-profit Mario Negri Institute and later posted on YouTube, constitute an oral history of Italy's outbreak as it unfolded, narrated by the first doctors in Europe to fight the coronavirus. Italian friends spread the word to doctors abroad and translations began for colleagues in Spain, France, Russia and the U.S., all bracing their own ICUs for a flood of patients. They offered \"a privileged window into the future,\" said Dr. Diego Casali of Cedars-Sinai Medical Center in Los Angeles, who is from northern Italy and was directed to the webinars when he sought advice from a front-line friend about how to prepare. Dr. Jane Muret of the French Society of Anesthesia-Resuscitation also heard by word-of-mouth and, impressed by the breathing-tube lessons, posted a translation when France had only a handful of diagnosed COVID-19 cases. \"Now we can recognize our COVID patients\" when they start showing up, she said. Every tidbit about the newest baffling symptom, every trick to try, served as clues as the virus bore down on the next city, the next country. By the time Donelson arrived, Goff's hospital was adjusting ventilator care based on that early advice. But while grateful for the global swirl of information, Goff also struggled to make sense of conflicting experiences. \"You have no idea how to interpret what went right or what went wrong,\" she said, \"or was it just the native course of the disease?\" Even now, months into a pandemic first wave that's more like constantly shifting tides, Goff is humbled at how difficult it remains to predict who will live and who will die. She can't explain why Donelson, finally home after a 90-day ordeal, was ultimately one of the lucky ones. _____ Doctors in Italy were confused: Reports from China were suggesting a death rate of about 3% among those infected. But for the first 18 days, only the dead left the ICU at Bergamo's large Pope John XXIII Hospital. While the toll eventually dropped, 30% of the hospital's initial 510 COVID-19 patients died. After decades in practice, ICU chief Dr. Luca Lorini thought he knew how to treat the dangerous kind of respiratory failure -- called ARDS, or acute respiratory distress syndrome -- first thought to be the main threat. \"Every night, I would go home and I had the doubt that I had gotten something wrong,\" Lorini said. \"Try to imagine: I am all alone and I can't compare it with France because the virus wasn't there, or Spain or the U.K. or America, or with anyone who is closer to me than China.\" Only later would it become clear that for patients sick enough to need the ICU, death rates were indeed staggeringly high. By February, China had filed only a limited number of medical journal reports on how patients were faring. Lorini's hospital tried to fill the data gap by dividing patients into small groups to receive different forms of supportive care and comparing them every three or four days -- not a scientific study, but some real-time information to share. The first lessons: The coronavirus wasn't causing typical ARDS, and patients consequently needed gentler ventilation than normal. They also needed to stay on those ventilators far longer than usual. \"We made big errors,\" Villani said, weaning patients off machines too soon. Then mid-March brought another startling surprise: In a training video for U.S. cardiologists, Chinese doctors warned that the virus causes dangerous blood clots, and not just in the lungs. Dr. Bin Cao of the China-Japan Friendship Hospital in Beijing explained that as the virus sneaks past the lungs into the bloodstream, it damages the lining of blood vessels, forming clots in the heart, kidneys, \"all over the body.\" He urged American doctors to use blood thinners protectively in the severely ill. In Italy's epicenter, doctors were making the same discovery. Lorini described a scramble to get the word out via Skype and email. \"This is a vascular sickness more than a pulmonary one and we didn't know that,\" he said. In the U.S., the finding about blood thinners made biological sense to Dr. Tiffany Osborn, a critical care physician at Washington University School of Medicine in St. Louis. \"It means at least you're not shooting in the dark. You're trying something that from a physiologic standpoint makes sense,\" said Osborn, who was living in a camper in her driveway to avoid bringing the virus home to her family after her long ICU shifts. By April, many doctors were bowing to pressure to try a malaria drug named hydroxychloroquine that obsessed President Donald Trump. Osborn never understood why such a drug would work and, sure enough, it eventually failed when put to a real test. But what else might be effective? \"We're learning as we go,\" Osborn said. \"You could talk to me in two weeks and I might be telling you something that's really different.\" _____ When Stephen Donelson arrived in the emergency room, \"we had very little hope for him,\" Goff said. The Midlothian man had undergone an organ transplant two years earlier, and the immune-suppressing drugs that prevent rejection of his new lungs and liver meant his body couldn't fight the coronavirus. Goff's first challenge: how to scale back those medicines just enough for Donelson to battle the virus without endangering his transplant. Her second: He was fighting against the ventilator's artificial breaths. So Goff deeply sedated Donelson, paralyzing his muscles to let the machine do all the work. Hospital after hospital struggled with balancing how to get enough air into oxygen-starved coronavirus patients without further damaging fragile lungs. Ventilation is like \"blowing air into a sponge and all the little holes are opening up. Walls between the holes can be very thin. If you're putting in a lot of air, it can damage the lining of those little holes,\" explained Osborn, the St. Louis critical care specialist. A trick the doctors shared with each other: Flip patients over from their backs to their stomachs - a procedure called proning that takes pressure off the lungs, which lie closer to the back. It also helps lower fluid accumulation in the lungs. It's not a one-time fix. Donelson stayed on his belly about 16 hours a day early on, as his doctors watched his oxygen levels improve. It's also hot and heavy work: Every turn took five or six health workers, in full safety garb, working in slow synchrony to avoid dislodging his breathing tube. Italy's Alessandro Manzoni Hospital set a schedule: Start turning patients onto their bellies at 2 p.m. -- it took more than three hours to work through them all -- and then put them on their backs again at 8 a.m., when fresh nurses arrived. Hospitals that specialize in treating ARDS knew how to prone before COVID-19 hit. For many others, it was a brand-new skill their workers had to learn. Fast. \"We've never had to prone anyone here before the pandemic, but now it's like second nature,\" Kevin Cole, a respiratory therapist at Fort Washington Medical Center in Maryland, said four months into the U.S. outbreak. And some hospitals now are asking patients not yet on ventilators to simply roll over periodically, in hopes it might prevent them from needing more invasive care. \"What have we got to lose? That's something that's not going to hurt anybody,\" Osborn said. _____ Even in normal times, critical-care specialists know they can't save all their patients. But they're used to more hand-holding. With this virus, even garbed in spacesuit-like protective gear, health workers must minimize time with infectious patients to avoid getting sick themselves. And family members are largely barred, too. \"My general way of doing things is, no one dies alone,\" said Osborn, who holds her phone in front of dying patients so loved ones can say goodbye. She paused to compose herself, and added: \"If this is going to happen, and you can provide some comfort that maybe they wouldn't have gotten if you weren't there, that's important.\" The newest lesson: Recovery takes a lot longer than surviving. Back in Dallas, Donelson spent 17 days on a ventilator. When it was removed, he was too weak to even sit without support and the breathing tube had taken away his ability to swallow. \"He would try to pick his head up off the pillow and it would lob to the side just like a newborn baby,\" said his wife, Terri Donelson, who for the first time since his hospital admission finally was allowed to connect with her husband through a videoconferencing app. For days after waking up, Donelson had tremendous delirium, a dangerous state of mental confusion and agitation. He didn't know where he was or why, and would try to pull out his IV tubes. Then a bacterial infection hit his lungs. Then one morning, worried that Donelson suddenly was too quiet, his doctor donned what she calls her \"full-helmet, Darth Vader-style mask, which cannot possibly help anyone's delirium,\" and went in to check on him. \"I rubbed his arm,\" Goff recalled, asking him to wake up. \"I said, 'Hey are you OK, are you with me?'\" and Donelson started trying to talk, at first too raspy to understand. Eventually, she made out that he was wishing her a happy Easter. She can only guess he heard the date on TV. Doctor and patient cried together. That was Donelson's turning point. He still wasn't deemed virus-free but physical therapists cautiously spent a little more time helping him gain strength and learn to swallow. His first bite: chocolate pudding. Terri Donelson countered the long periods of isolation by keeping the video app running non-stop, talking to her husband and giving him quizzes to stimulate his memory. \"Little by little, with each day, he gains something new, something else reawakens,\" she said. Finally, on June 19, 90 days after the frantic ambulance ride, Donelson - still weak but recovering - went home. His doctor is humbled by his survival, and anxiously awaiting better science to help guide care as the pandemic continues. \"If you have one patient who leaves a really strong impression on you, you may interpret that patient's experience to be hallmark. Until we have large, population-based studies of actual outcomes, it's really hard to know what's real and what's not real,\" Goff said. ___ Neergaard reported from Alexandria, Va., and Winfield from Rome. AP video journalist Nathan Ellgren contributed to this report. Notifications can be turned off anytime in the browser settings. ", "Dr. Peter Barkett of Kaiser Permanente Silverdale Medical Center said he's not only seeing a spike in cases at his hospital in Kitsap County, but a spike among younger adults. \"There is a significant role for the kind of lax hangouts, the backyard barbecues in the spread of COVID, especially among the age group of whom we are seen the highest numbers, the 20 to 39-year-old age group,\" said Barkett. Barkett said things like social distancing and contact tracing aren't being used all the time by this age bracket. He said one thing he often hears from younger adults is that they continue to socialize to offset the adverse mental health effects isolation can take. \"I don't want to tell anybody to hole up in a basement and to kind of hunker down for the next year or two until COVID goes away, but if you do go outside, and especially if you're around other people, try to do it in a way that's safe,\" he said. Contact tracing for that age group is also proving to be difficult. Kim Steele-Peter, a branch director at Tacoma Pierce County Health Department, said that age range is tough to get a hold of. \"What the case and contact investigators are finding is that when they talk to people in that age range, they're more reluctant to tell us who their close contacts are, they don't want to give up their names,\" said Steele-Peter. Contact-tracing and case investigating have been explained by the Washington Department of Health as a critical step to get the state fully reopened. When someone tests positive for COVID-19, a case investigator contacts them, usually by phone, and asked them a series of questions about who they were with and where they were. From that conversation, contact tracers find the people who might have come into contact with the infected person, lets them know and provides information and test locations. Local health districts are in charge of their own contact tracers, but the majority of the funding for them comes from the national CARES Act. Steele-Peter said they're having a harder time getting younger adults to partake-- whether that's giving away friends' information or simply picking a call from an unknown number. RELATED: What is contact tracing, and how does it work with COVID-19? \"There's usually a reason behind it. It may be that they don't know the person that well or that they didn't really know how to get in touch with them,\" she said. It's not just Pierce County. Skagit County Health Officer Howard Leibrand explained over the phone that while most are willing to discuss who've they've been in contact with, a minority of people that contact tracers call are not, and those typically are younger adults. \"There's a small number of people out there who think it's none of their business,\" he said. During Tuesday's weekly COVID-19 virtual update for Snohomish County, Health Officer Dr. Chris Spitter's had this request regarding contact tracing: \"We do want to remind people that in order for them to do their job and achieve the function of containing and suppressing transmission we need people to answer their phones and respond to the text messages when they receive them.\" Steele-Peter believes the system works. She was a contact tracer in the 1980's during the AIDS epidemic and said she's noticing similar apprehension. What worked then and what needs to happen now from contact tracers is recognizing the reasons why they may be withholding information and educating why it's beneficial. \"You may feel like, there are so many other people out there who could provide this information, that you providing your partner's information is not necessarily that important, but it is and taking the time to explain that for every person out there.\" She said that it's important that folks in the age group between 20-39 understand that they're not being blamed, but that contact tracers want to help. \"Every piece of information that they can give us, every close contact is truly important.\" RELATED: Trump administration reportedly opposes new funding for COVID-19 testing, contact tracing Notifications can be turned off anytime in the browser settings. ", "SEATTLE - Although separated by 142 miles of interstate, at first glance it appears the cities of Vancouver, B.C. and Seattle are quite similar. However, the biggest glaring difference is reflected in the coronavirus numbers. According to BC's Ministry of Health, on July 21, the Vancouver Coastal Health District reported a total of 1,043 with 103 confirmed deaths. King County, on the other hand, reported 13,450 with 638 deaths on July 20. In other words, while BC as a whole has more than two million fewer people than Washington State, we've had nearly 13 times as many positive cases of coronavirus. \"If we had allowed our leaders, our scientists to come out and say what needs to be done and stick to it. We would have saved a lot of lives in the US,\" said Dr. Ali Mokdad, UW's Institute for Health Metrics and Evaluation (IHME). RELATED: Report: More Americans look at moving to Canada as coronavirus surges IHME is an independent health research center that's a part of the University of Washington. Mokdad has made his career studying global health. He said while as a whole, Canadians have done a better job adopting social distancing practices, there are a few key differences worth pointing out. First and foremost, western Washington was essentially caught on its heels as the epicenter of the virus that landed in February. The outbreak ultimately led to the closure of the international border in mid-March. Earlier this month, the Canadian government announced that the U.S./Canadian border closure would be extended through late August. \"We have to put (the number of cases) in context. British Columbia lives in a sea of COVID-19. If you look at the case numbers in Washington state or in Alberta, they would be, I would say, not happy, but pretty happy to have the case numbers we have here,\" said Adrian Dix, British Columbia's Minister of Health. RELATED: Coronavirus updates: Canada, US poised to extend border restrictions to Aug. 21 Notifications can be turned off anytime in the browser settings. ", "SEATAC, Wash. - In its first week of operation, a new machine that screens Sea-Tac Airport passengers for fevers didn't catch any travelers with a high temperature. \"It's been very well received by the public and it's been a really helpful and informative proof of concept,\" Julie Collins, Sea-Tac Airport director of customer experience, said during a meeting with airport management Tuesday. The airport instituted the pilot program about two weeks ago. It's entirely voluntary, but the machine will flag passengers running a temperature over 100.4 degrees. The scanner has screened 6,700 passengers so far and checks about 700 people per day, according to the airport. Although the airport hasn't found any travelers with a high fever yet, Collins said flagged passengers would go through additional medical screening to determine why they have an elevated temperature. Collins said the airport has faced some challenges with the temperature checks, including higher staff demands, keeping passenger traffic flowing efficiently and making sure passengers are removing hats and glasses and looking at the camera. RELATED: American, Southwest end face mask medical exceptions; Delta expands testing The temperature checker is just one of several safety measures the airport implemented during the coronavirus pandemic. Motion censors are being installed to restroom faucets. A new app, which allows travels to purchase food and limit contact with staff, is available for download. Since May 18, face coverings have been required inside the airport. The airport has escalated it's cleaning and disinfecting procedures. Staff spend 5,000 hours a week cleaning and so far the airport has gone through 1,268 gallons of hand sanitizer, 1,394 containers of sanitizer wipes and more than 5,012 ounces of disinfecting spray. During the Tuesday meeting, airport officials said passengers can expect a full-time worker at the TSA checkpoint sanitizing the bins and bowls that get sent through security. Still, the airport is urging people who are sick to stay home. RELATED: Sea-Tac Airport to take passenger temperatures to reduce COVID-19 Passenger traffic is increasing, but travel is still nowhere near where it was in this time last year. Right now, the number of visitors sits near 15,900, which is a 76% decrease compared to 2019. Notifications can be turned off anytime in the browser settings. ", "One of the nation's largest teachers unions is authorizing its members to strike if their schools plan to reopen without proper safety measures in the middle of the global pandemic. The American Federation of Teachers, which represents 1.7 million school employees, issued a resolution on Tuesday saying it will support any local chapter that decides to strike over reopening plans. In providing its blessing, the union is also offering local chapters access to its financial and legal resources as they navigate a return to the classroom. Union officials said they will provide legal support, communications support and staffing to local chapters that vote to strike. Although the measure says strikes should be considered only as a \"last resort,\" it lists conditions the organization wants met for schools to reopen. It says buildings should reopen only in areas with lower virus rates, and only if schools require masks, update ventilation systems and make changes to space students apart. RELATED: CDC releases 'Decision-Making Tool' for parents in school reopening guidance RELATED: Trump says some schools may need to delay reopening in the fall In announcing the measure, the union's president blasted President Donald Trump for pressuring schools to reopen even as the virus continues to surge. Randi Weingarten called Trump's response \"chaotic and catastrophic,\" saying it has left teachers afraid. \"We will fight on all fronts for the safety of our students and their educators,\" Weingarten said. \"But if authorities don't protect the safety and health of those we represent and those we serve, as our executive council voted last week, nothing is off the table.\" The union's leaders approved the resolution Friday but announced it Tuesday at the group's convention, which is being hosted online amid the pandemic. The nation's largest teachers union, the National Education Association, separately said its members will do \"whatever it takes\" to protect students. \"Nobody wants to see students back in the classroom more than educators, but when it comes to their safety, we're not ready to take any options off the table,\" the group's president, Lily Eskelsen García, said in a statement. For weeks, Trump has pressed for a full reopening of the nation's schools. Last week he acknowledged that some schools may need to delay a return to in-person instruction, but he's still asking Congress to withhold future virus relief to schools that fail to reopen. Some of the nation's largest public school districts are starting the school year online, including in Los Angeles, Atlanta and Houston. The Chicago Teachers Union, which has clashed with the city over its school reopening plan, said on Tuesday that it isn't ruling out a work stoppage. \"It's long past time for our nation's educators to come together and fight collectively for the common good - up to and including striking to ameliorate the social and economic inequalities at the root of the consequences of this insidious virus,\" the union's vice president, Stacy Davis Gates, said in a statement. Davis Gates said any safety strike would include broader demands to support front-line workers, to provide broadband access to every student, to ensure universal health care and to get \"a hard commitment from public officials to protect Black and Brown lives, whose neighborhoods are disproportionately bearing the burden of death and illness from COVID-19.\" In Massachusetts, nurses represented by the Boston Teachers Union are planning a sit-in at City Hall on Wednesday over the city's reopening plan. The nurses are calling for rapid testing in schools to identify COVID-19, the disease caused by the coronavirus. They also want more protective equipment for nurses and teachers and assessments of air quality in school buildings, among other measures. In Ohio's largest district, about 2,700 Columbus City Schools educators had previously signed a letter calling on leaders to start the fall term online, with the union arguing that the stakes \"are too high for experiments.\" They got their wish Tuesday as the district announced it will start the year with virtual learning for all students in pre-kindergarten through 12th grade. For other districts planning to reopen, the federation's safety demands could be difficult to meet. The union says schools should open only in areas where the infection rate among those tested for the disease caused by the coronavirus, COVID-19, is below 5%, and where the transmission rate is below 1%. It also says local authorities must have plans to close schools if cases spike. Along with mask requirements, the union is also pushing schools to keep people 6 feet apart, to keep buildings and buses clean, and to make accommodations for teachers at greater risk of health problems if they contract COVID-19. For many schools, more funding will be needed to reopen safely, the union said. It estimates the average school will need at least $1.2 million, amounting to $116 billion nationwide. The resolution says Trump and Senate Republicans have \"have failed to negotiate and pass a new stimulus bill to address the resources vitally needed for reopening our schools.\" The latest stimulus proposal from the White House and Senate Republicans includes $105 billion for schools and colleges, though some of the money is only for schools that reopen for in-person classes. In May, the Democratic-led House included $100 billion for schools - none of it limited to those holding on-site classes - but House Speaker Nancy Pelosi has said even more money is needed. In her speech, Weingarten said teachers want schools to reopen. Children need in-person instruction, she said, adding that remote instruction is \"no substitute for it.\" But she said teachers need to know they'll be kept safe. Before Trump began pressing schools to reopen, she said, a union poll found that its members were comfortable returning if proper safeguards were in place. \"Now they're afraid and angry,\" she said. \"Many are quitting, retiring or writing their wills.\" Along with strikes, the union said it will fight unsafe reopening plans through lawsuits and labor grievances. The union's Florida chapter filed a lawsuit last week attempting to block the state's plan to reopen schools, which the suit called \"reckless and unsafe.\" Notifications can be turned off anytime in the browser settings. ", "Kohl's has announced it will close its stores on Thanksgiving day in 2020 as part of its plans reflecting \"a year like no other.\" Over the past two weeks, a handful of other major retailers said their stores would also be closing on Thanksgiving including Best Buy, Target and Walmart. As part of its announcement, Kohl's said it expects more customers to shop earlier and throughout the season, given the importance of safety surrounding the coronavirus pandemic. In 2019, Kohl's opened its stores at 5 p.m. on Thanksgiving Day to kick-off Black Friday shopping. Kohl's said it plans to offer more information on its holiday hours at a later date. \"The holiday season is when Kohl's shines brightest, and as we move into the holiday season of this very unusual year, we are adapting our plans in response to changing customer expectations and behaviors,\" said Michelle Gass, Kohl's chief executive officer. \"We are deeply appreciative of how our team of Kohl's associates have shown up to serve our customers through this pandemic and know that they will continue to show Kohl's at our best throughout the holidays.\" With fears of a wave of virus cases in the fall, the biggest nightmare would be if retailers had to close down again during the most critical time of the year, analysts said. \"Historically, deal hunting and holiday shopping can mean crowded events, and this isn't a year for crowds,\" Minneapolis-based Target said in a corporate blog post about its Thanksgiving Day plans earlier this week. It said its holiday deals would come earlier than ever - starting in October. Walmart, the nation's largest retailer, announced its move last week. Target opened for the first time on Thanksgiving in 2011, joining other stores in starting Black Friday sales a day early and creating a new tradition of shoppers heading out to the stores after their turkey feast. Many retailers did so because they were trying to better compete with Amazon and other online players. RELATED: Best Buy to close stores on Thanksgiving Day RELATED: Target to close stores on Thanksgiving, dampening Black Friday kickoff RELATED: Walmart plans to close for Thanksgiving given the 'unusual year' But sales ended up eating into Black Friday and many critics lambasted stores for not honoring the holiday and allowing their workers to spend it with family. In response to the backlash and also poor sales, some stores and malls like Bloomington, Minnesota-based Mall of America, reversed course and have not to opened on Thanksgiving in recent years. Costco and Nordstrom among others have always remained closed on Thanksgiving, noting they want to respect the holiday. The bigger question still looms on how to handle Black Friday itself, which also draws huge crowds - and sales. Despite competition from Thanksgiving shopping, Black Friday ranks as either the top or No. 2 sales day of the year. Thanksgiving is not even in the top 10 because sales start around 5 p.m. But the day ranked third in online shopping behind Cyber Monday and Black Friday respectively last year, according to Adobe Analytics, which tracks online sales for 80 of the top 100 retailers. The Associated Press Contributed to this report. Notifications can be turned off anytime in the browser settings. ", "WASHINGTON - As the 2020-21 school year gets closer in Washington state, many school districts are announcing plans for how education will continue in the fall amid the coronavirus pandemic. Below is a list of some of the school districts in western Washington that have announced whether they will be conducting in-person learning, remote learning or a combination of both. Superintendent Dr. Alan Spicciati of the Auburn School District announced the district will start the 2020-21 school year with a full distance learning model. Dr. Spicciati said they are still planning for a return to in-person instruction in a hybrid or full-time model when public health officials advise it is safe, but at that time families will still have the option to continue distance learning. In a letter to parents, Dr. Spicciati said \"We are committed to serving our students with high-quality distance learning. There will be clear expectations, accountability and collaboration for instruction and assignments. We are developing resources and training for staff and families to support the distance learning environment. Students and staff will be held to standards. Grading practices and daily attendance expectations will return. The distance learning will be significantly improved from last spring.\" The superintendent also said distance learning may not fully meet the needs of some students with special needs and English learners, so the district is evaluating how they can provide services to students who need them. The district expects to have more information for parents in the coming weeks. The Bellevue School District announced it will start the 2020-21 school year with remote learning for all families. The district plans to evaluate the remote start for all after the first six weeks of school, said Superintendent Ivan Duran in a letter to families. The district said families that opted to participate in a Hybrid Learning model will begin school in a Temporary Remote Learning model with a plan to move to the Hybrid Learning model when COVID-19 infection rates decrease. There will be no change for families that opted to participate in the Bellevue School District Virtual Learning model for the first semester. The district will be reaching out to families again to confirm their intent to enroll in either the Temporary Remote/Hybrid Learning model or the BSD Virtual Learning model. On July 27, the district will share with families daily remote learning schedules to provide a better understanding of what their child's learning experience will be like. A questionnaire will be going out to families on July 28 with a due date of July 31. The responses will help the district in assigning students to educators and building schedules for middle and high school students, the district said. The BSD will offer limited in-person services to support students and families including childcare, services for students with specific needs and learning support at schools for elementary, middle and high school students. The Central Kitsap School District will begin the year fully remote for \"at least the first nine weeks,\" following the Kitsap Public Health District advising against opening schools for traditional classroom learning. The district has \"developed an improved, more robust remote learning experience that will have increased expectations for student participation, more consistency for delivery of content, and better feedback to students and families.\" The district has plans in place for hybrid learning models, should officials determine it safe for students to return to class. Citing current data and recommendations from Tacoma-Pierce County Health Department Director Dr. Anthony Chen, Clover Park School District will start the year with remote learning. The district has a three-phase plan in place to implement in-person learning, depending on health and safety guidelines: virtual learning, hybrid learning in which students alternate time in school and at home, and in-person learning. Read the full statement from Superintendent Ron Danner here. The Edmonds School District will use a hybrid learning model in the fall that allows students to either split their time between in-person learning and remote learning, or participate in online-only learning. Under the hybrid model, students who are attending in-person classes in the fall will be split into two groups. They will attend classes two days a week and online classes three days a week. In-person classes will be held Mondays, Tuesdays, Thursdays, and Fridays. Wednesdays will be remote learning for everyone, allowing for deep cleaning of buildings. The model was chosen because the district is \"not able to accommodate all students in schools at the same time and also maintain student and staff safety\" when it comes to proper social distancing, among other requirements. Families will also have the option to continue with full-time remote learning. RELATED: Edmonds School District will have mix of remote, in-person learning in fall Federal Way Public Schools will begin the 2020-21 school year with 100% remote learning. The district said if the rate of coronavirus infection diminishes and public health guidelines support returning to in-person classes, the district will transition to a hybrid model of two days of in-person classes and three days of remote learning. In a letter to parents and staff, Superintendent Tammy Campbell promised a \"much more robust, structured, and consistent\" remote learning model than in spring. The district will continue to loan laptops and will implement instructional schedules that alternate elementary, middle and high school classes when possible. Child care will also be offered for special needs students and kindergartners through 5th graders through Right At School. The Kent School District announced that schools will begin the 2020-21 school year with remote learning. The district looked at data from a staff and family survey, as well as guidance from health officials and the district's Back to School Task Force in making the decision to start remotely for the upcoming school year. Remote learning will be consistently provided with more explicit expectations and accountability for instruction and assignments, the district said. Learning opportunities and support for families on the districtwide learning management system, supplemental learning applications, and student-teacher communication platform will also be provided, according to the district. In the coming weeks, the district will be focusing on finalizing its improved remote learning plan, including professional learning for all staff and supports for students, families, and staff. The final version of the plan will be shared with the Kent School Board and posted on the district's website on Aug. 3. Community feedback will be accepted at that time online or via Zoom. The remote learning school year will begin on August 27. RELATED: Kent School District will start with remote learning in the fall The Lake Washington School District will start the 2020-21 school year with a fully remote learning model. \"This decision is being made after a thorough review of available reports and local models.  Additionally, I have spent time discussing the current state of our community and county with the King County Department of Health. Given this and the limited guidance districts have received related to re-opening school in the fall; it was decided to start the school year in a remote model,\" said Superintendent Dr. Jon Holmen in a letter to families. Parents and students can expect to see changes with the upcoming remote learning model including the use of Microsoft Classroom Teams as the sole Learning Management System, synchronous/live instruction balanced through the week and varying by age of the student, daily attendance, typical grading practice and the opportunity for whole and small group experiences. The superintendent said some students will require in-person learning and that will help the district better plan for returning more students to in-person instruction in the future. The district is also still working out how to help families with childcare. More information is expected to be released in August. The Northshore School District will continue with remote learning when classes resume in the fall. The district is using a six-stage approach for people re-entering school. The stages allow educators to pivot between remote learning, a hybrid model, and in-person learning. The stages are determined by the impacts of the current health situation, resources, and direction from state officials. As of July 21, the district was in Stage 2, which means 100 percent remote learning for students. Staff will have \"limited and monitored access\" to schools for planning and delivering instruction. It isn't until Stage 3 when students with the \"greatest need of additional support\" can go to school two days a week for in-person instruction. Each stage adds additional students to a limited number of in-class days until Stage 6, when all students and staff attend in-person class five days a week. RELATED: Students in the Northshore School District will begin year with remote education After \"an extensive review\" of data and updates from the Kitsap Public Health District, officials with the North Kitsap School District decided to begin the school year with remote learning. All students enrolled in the district's hybrid in-person model will also start with remote-only learning. After nine weeks, the district will reassess conditions in Kitsap County, evaluate guidance from state and local officials, \"upon which we will base decisions about how to best serve students.\" Students in the Online Academy will learn remotely for the entire year. North Thurston Public Schools will have a hybrid model of in-person and remote classes. Students will have two days of in-person instruction with \"continuous\" remote learning off-site. Cohorts will rotate between either a Monday/Wednesday or Tuesday/Thursday schedule in-person with priority for families to be on the same schedule. Parents can also choose a 100% remote option if they would like. The Peninsula School District plans to offer 100% in-person classes and remote learning, based on what parents choose. The district cited a parent survey, which found 71% were interested in in-person learning, as one reason for its decision. The plan will be presented to the Peninsula School Board on July 23, and parents can register for classes from July 27 to August 5. The district asks parents to commit to one option for at least one semester or trimester so the district can plan staffing. The Puyallup School District shared the following news with families on July 23: \"The Tacoma-Pierce County Health Department has just announced that based on current levels of COVID-19 in our community, it is not safe to open schools this fall.  Therefore, school will start on Sept. 3 in a full-time Continuous (Distance) Learning model 2.0. At this time, we cannot predict exactly how long we will remain in a full-time distance learning model.  We will continue to rely on public health guidance in monitoring community health and re-analyze our situation 6-8 weeks after school begins Sept. 3.\" The Renton School District announced it plans to start the 2020-21 school year with a fully in-home learning model. \"At this time, we cannot predict how long we will remain in the in-home learning model. However, we will continue to monitor infection rates and rely on public health guidance to determine when we can reopen our school buildings to students,\" said Superintendent Damien Pattenaude. The district said it plans to include more live instruction in its new in-home learning model, small group support and fewer learning platforms. It will also provide all students in grades 6-12 with their own Chromebooks and will provide Chromebooks to any K-5 students who need them. Families that need internet connectivity will also be provided with a hotspot, according to the district. Information on technology distribution will be given to families in the coming weeks. Seattle Public Schools Superintendent Denise Juneau announced the district is recommending a remote learning model for the 2020-21 school year until the risk of COVID-19 transmission decreases enough for in-person learning to resume. In its recommendation, the district plans to provide: The SPS Board of Directors will vote on the superintendent's recommendation and an associated plan for the upcoming school year during its regular board meeting on August 12. The recommendation for remote learning is a shift from the district's previous hybrid plan that included in-person/in-school learning and remote learning. RELATED: Seattle Public Schools superintendent recommends starting school remotely this fall Families in Tacoma can choose to keep their kids at home for 100% remote learning or participate in a hybrid model with a mix of in-person and remote classes. The hybrid model will vary based on grade level. Elementary school Kindergarten through first graders and possibly second graders: Four days of in-person classes a week and one day of distance learning. Third through fifth graders: Two days of in person classes and three days of distance learning. Middle school and high school Two days of in-person classes and three days of distance learning The district will distribute laptops to all high school students starting in August and then will work on plans to give laptops to middle school students and elementary students. The district has ordered laptops for all first through 12th graders, but the laptops are on backorder and could take 150 days to arrive. The Tahoma School District will have 100% remote learning for the first quarter of the school year. In a letter to families and staff, Superintendent Mike Hanson said the district acknowledged in-person learning was most beneficial for students, but said it would be \"very difficult\" to reopen schools in person considering the current COVID-19 transmission rate. The school district says remote learning will be different than the spring, and it plans to use remote learning curriculum from Edgenuity in conjunction with Tahoma curriculum. This list will continue to be updated by KING 5 Staff as more school districts announce plans for the fall. State list of Washington school districts, charter schools, tribal schools, and ESDs Notifications can be turned off anytime in the browser settings. ", "WASHINGTON - U.S. officials say Russian intelligence officers are spreading disinformation about the coronavirus pandemic through English-language websites, trying to exploit a crisis that America is struggling to contain before the presidential election in November. Two Russians who have held senior roles in Moscow's military intelligence service known as the GRU have been identified as responsible for a disinformation effort meant to reach American and Western audiences, according to U.S. government officials. They were not authorized to discuss the matter publicly and spoke on condition of anonymity Tuesday. Russian officials on Wednesday rejected the accusations as \"conspiracy theories\" and a \"persistent phobia.\" One of the sites singled out by the U.S. posted a response denouncing as \"categorically false\" the American assertions that it was linked to the Russian military intelligence service or was involved in propaganda. The information had previously been classified, but U.S. officials said it had been downgraded so they could more freely discuss it. Officials said they were doing so now to sound the alarm about the particular websites and to expose what they say is a clear link between the sites and Russian intelligence. Between late May and early July, one of the officials said, the websites published about 150 articles about the pandemic response, including coverage aimed either at propping up Russia or denigrating the U.S. Among the headlines that caught the attention of U.S. officials were \"Russia's Counter COVID-19 Aid to America Advances Case for Détente,\" which suggested that Russia had given urgent and substantial aid to the U.S. to fight the pandemic, and \"Beijing Believes COVID-19 is a Biological Weapon,\" which amplified statements by the Chinese. RELATED: Russia denies US, UK accusations of weapon test in space RELATED: VERIFY: Yes, a Trump Facebook ad does include a picture from the 2014 Ukraine Revolution The spread of disinformation, including by Russia, is an urgent concern heading into the November vote. U.S. officials want to avoid a repeat of the 2016 contest, when a Russian troll farm launched a covert social media campaign to divide American public opinion and to favor then-candidate Donald Trump over Democrat Hillary Clinton. The U.S. government's chief counterintelligence executive warned in a rare public statement Friday about Russia's continued use of internet trolls to advance their goals. The pandemic and race relations and protests across the U.S. have offered fertile territory for misinformation or outfight falsehoods. Trump himself has come under scrutiny for sharing misinformation about a disproved drug for treating the coronavirus in videos that were taken down by Twitter and Facebook. Officials did not say whether the effort behind these particular websites was directly related to the November election, though some of the coverage appeared to denigrate Trump's Democratic challenger, Joe Biden, and called to mind Russian efforts in 2016 to exacerbate race relations in America and spread corruption allegations against U.S. political figures. U.S. officials have warned before about the spread of disinformation tied to the pandemic. But on Tuesday, they went further by singling out a particular information agency that is registered in Russia, InfoRos. It operates a series of websites - InfoRos.ru, Infobrics.org and OneWorld.press - that have leveraged the pandemic to promote anti-Western objectives and to spread disinformation. Officials say the sites promote their narratives in a sophisticated way that they liken to money laundering, where stories in well-written English - and often with pro-Russian sentiment - are cycled through other news sources to conceal their origin and enhance the legitimacy of the information. The sites also amplify stories that originate elsewhere, the government officials said. An email to InfoRos was not immediately returned Tuesday. OneWorld rejected the allegations as \"categorically false\" in a statement posted Wednesday. Kremlin spokesman Dmitry Peskov called the allegations \"some kind of a persistent phobia.\" He said the Russian press was continuing to cover the coronavirus and that there was \"no need need to blame objective and quality work of the media.\" A headline Tuesday on InfoRos.ru about the unrest roiling American cities read \"Chaos in the Blue Cities,\" accompanying a story that lamented how New Yorkers who grew up under the tough-on-crime approach of former Mayors Rudy Giuliani and Michael Bloomberg \"and have zero street smarts\" must now \"adapt to life in high-crime urban areas.\" Another story carried the headline of \"Ukrainian Trap for Biden,\" and claimed that \"Ukrainegate\" - a reference to stories surrounding Biden's son Hunter and his former ties to a Ukraine gas company - \"keeps unfolding with renewed vigor.\" U.S. officials have identified two of the people believed to be behind the sites' operations. The men, Denis Valeryevich Tyurin and Aleksandr Gennadyevich Starunskiy, have previously held leadership roles at InfoRos but have also served in a GRU unit specializing in military psychological intelligence and maintain deep contacts there, the officials said. RELATED: US accuses Chinese hackers of targeting COVID-19 research RELATED: Report: Hard to prove Russian influence on UK referendum InfoRos and One World's ties to the Russian state have attracted scrutiny in the past from European disinformation analysts. In 2019, a European Union task force that studies disinformation campaigns identified One World as \"a new addition to the pantheon of Moscow-based disinformation outlets.\" The task force noted that One World's content often parrots the Russian state agenda on issues including the war in Syria. A report published last month by a second, nongovernmental organization, Brussels-based EU DisinfoLab, examined links between InfoRos and One World to Russian military intelligence. The researchers identified technical clues tying their websites to Russia and identified some financial connections between InfoRos and the government. \"InfoRos is evolving in a shady grey zone, where regular information activities are mixed with more controversial actions that could be quite possibly linked to the Russian state's information operations,\" the report's authors concluded. On its English-language Facebook page, InfoRos describes itself as an \"Information agency: world through the eyes of Russia.\" ___ Litvinova reported from Moscow. Associated Press writer David Klepper in Providence, Rhode Island, contributed to this report. Notifications can be turned off anytime in the browser settings. ", "Amid the chaos of the pandemic's early days, doctors who faced the first coronavirus onslaught reached across oceans and language barriers in an unprecedented effort to advise colleagues trying to save lives in the dark. With no playbook to follow and no time to wait for research, YouTube videos describing autopsy findings and X-rays swapped on Twitter and WhatsApp spontaneously filled the gap. When Stephen Donelson arrived at the University of Texas Southwestern Medical Center in mid-March, Dr. Kristina Goff was among those who turned to what she called \"the stories out of other places that were hit before.\" Donelson's family hadn't left the house in two weeks after COVID-19 started spreading in Texas, hoping to shield the organ transplant recipient. Yet one night, his wife found him barely breathing, his skin turning blue, and called 911. In New York or Italy, where hospitals were overflowing, Goff thinks Donelson wouldn't even have qualified for a then-precious ventilator. But in Dallas, \"we pretty much threw everything we could at him,\" she said. Like doctors everywhere, Goff was at the beginning of a huge and daunting learning curve. RELATED: US hits 6 months since first reported COVID-19 case RELATED: US officials: Russia behind spread of coronavirus disinformation \"It's a tsunami. Something that if you don't experience it directly, you can't understand,\" Italian Dr. Pier Giorgio Villani said in a series of webinars on six straight Tuesday evenings to alert other intensive care units what to expect. They started just two weeks after Italy's first hospitalized patient arrived in his ICU, and 10 days before Donelson fell ill in Texas. Villani, who works in the northern city of Lodi, described a battle to accommodate the constant flow of people needing breathing tubes. \"We had 10, 12, 15 patients to intubate and an ICU with seven patients already intubated,\" he said. The video sessions, organized by an Italian association of ICUs, GiViTI, and the non-profit Mario Negri Institute and later posted on YouTube, constitute an oral history of Italy's outbreak as it unfolded, narrated by the first doctors in Europe to fight the coronavirus. Italian friends spread the word to doctors abroad and translations began for colleagues in Spain, France, Russia and the U.S., all bracing their own ICUs for a flood of patients. They offered \"a privileged window into the future,\" said Dr. Diego Casali of Cedars-Sinai Medical Center in Los Angeles, who is from northern Italy and was directed to the webinars when he sought advice from a front-line friend about how to prepare. Dr. Jane Muret of the French Society of Anesthesia-Resuscitation also heard by word-of-mouth and, impressed by the breathing-tube lessons, posted a translation when France had only a handful of diagnosed COVID-19 cases. \"Now we can recognize our COVID patients\" when they start showing up, she said. Every tidbit about the newest baffling symptom, every trick to try, served as clues as the virus bore down on the next city, the next country. By the time Donelson arrived, Goff's hospital was adjusting ventilator care based on that early advice. But while grateful for the global swirl of information, Goff also struggled to make sense of conflicting experiences. \"You have no idea how to interpret what went right or what went wrong,\" she said, \"or was it just the native course of the disease?\" Even now, months into a pandemic first wave that's more like constantly shifting tides, Goff is humbled at how difficult it remains to predict who will live and who will die. She can't explain why Donelson, finally home after a 90-day ordeal, was ultimately one of the lucky ones. _____ Doctors in Italy were confused: Reports from China were suggesting a death rate of about 3% among those infected. But for the first 18 days, only the dead left the ICU at Bergamo's large Pope John XXIII Hospital. While the toll eventually dropped, 30% of the hospital's initial 510 COVID-19 patients died. After decades in practice, ICU chief Dr. Luca Lorini thought he knew how to treat the dangerous kind of respiratory failure -- called ARDS, or acute respiratory distress syndrome -- first thought to be the main threat. \"Every night, I would go home and I had the doubt that I had gotten something wrong,\" Lorini said. \"Try to imagine: I am all alone and I can't compare it with France because the virus wasn't there, or Spain or the U.K. or America, or with anyone who is closer to me than China.\" Only later would it become clear that for patients sick enough to need the ICU, death rates were indeed staggeringly high. By February, China had filed only a limited number of medical journal reports on how patients were faring. Lorini's hospital tried to fill the data gap by dividing patients into small groups to receive different forms of supportive care and comparing them every three or four days -- not a scientific study, but some real-time information to share. The first lessons: The coronavirus wasn't causing typical ARDS, and patients consequently needed gentler ventilation than normal. They also needed to stay on those ventilators far longer than usual. \"We made big errors,\" Villani said, weaning patients off machines too soon. Then mid-March brought another startling surprise: In a training video for U.S. cardiologists, Chinese doctors warned that the virus causes dangerous blood clots, and not just in the lungs. Dr. Bin Cao of the China-Japan Friendship Hospital in Beijing explained that as the virus sneaks past the lungs into the bloodstream, it damages the lining of blood vessels, forming clots in the heart, kidneys, \"all over the body.\" He urged American doctors to use blood thinners protectively in the severely ill. In Italy's epicenter, doctors were making the same discovery. Lorini described a scramble to get the word out via Skype and email. \"This is a vascular sickness more than a pulmonary one and we didn't know that,\" he said. In the U.S., the finding about blood thinners made biological sense to Dr. Tiffany Osborn, a critical care physician at Washington University School of Medicine in St. Louis. \"It means at least you're not shooting in the dark. You're trying something that from a physiologic standpoint makes sense,\" said Osborn, who was living in a camper in her driveway to avoid bringing the virus home to her family after her long ICU shifts. By April, many doctors were bowing to pressure to try a malaria drug named hydroxychloroquine that obsessed President Donald Trump. Osborn never understood why such a drug would work and, sure enough, it eventually failed when put to a real test. But what else might be effective? \"We're learning as we go,\" Osborn said. \"You could talk to me in two weeks and I might be telling you something that's really different.\" _____ When Stephen Donelson arrived in the emergency room, \"we had very little hope for him,\" Goff said. The Midlothian man had undergone an organ transplant two years earlier, and the immune-suppressing drugs that prevent rejection of his new lungs and liver meant his body couldn't fight the coronavirus. Goff's first challenge: how to scale back those medicines just enough for Donelson to battle the virus without endangering his transplant. Her second: He was fighting against the ventilator's artificial breaths. So Goff deeply sedated Donelson, paralyzing his muscles to let the machine do all the work. Hospital after hospital struggled with balancing how to get enough air into oxygen-starved coronavirus patients without further damaging fragile lungs. Ventilation is like \"blowing air into a sponge and all the little holes are opening up. Walls between the holes can be very thin. If you're putting in a lot of air, it can damage the lining of those little holes,\" explained Osborn, the St. Louis critical care specialist. A trick the doctors shared with each other: Flip patients over from their backs to their stomachs - a procedure called proning that takes pressure off the lungs, which lie closer to the back. It also helps lower fluid accumulation in the lungs. It's not a one-time fix. Donelson stayed on his belly about 16 hours a day early on, as his doctors watched his oxygen levels improve. It's also hot and heavy work: Every turn took five or six health workers, in full safety garb, working in slow synchrony to avoid dislodging his breathing tube. Italy's Alessandro Manzoni Hospital set a schedule: Start turning patients onto their bellies at 2 p.m. -- it took more than three hours to work through them all -- and then put them on their backs again at 8 a.m., when fresh nurses arrived. Hospitals that specialize in treating ARDS knew how to prone before COVID-19 hit. For many others, it was a brand-new skill their workers had to learn. Fast. \"We've never had to prone anyone here before the pandemic, but now it's like second nature,\" Kevin Cole, a respiratory therapist at Fort Washington Medical Center in Maryland, said four months into the U.S. outbreak. And some hospitals now are asking patients not yet on ventilators to simply roll over periodically, in hopes it might prevent them from needing more invasive care. \"What have we got to lose? That's something that's not going to hurt anybody,\" Osborn said. _____ Even in normal times, critical-care specialists know they can't save all their patients. But they're used to more hand-holding. With this virus, even garbed in spacesuit-like protective gear, health workers must minimize time with infectious patients to avoid getting sick themselves. And family members are largely barred, too. \"My general way of doing things is, no one dies alone,\" said Osborn, who holds her phone in front of dying patients so loved ones can say goodbye. She paused to compose herself, and added: \"If this is going to happen, and you can provide some comfort that maybe they wouldn't have gotten if you weren't there, that's important.\" The newest lesson: Recovery takes a lot longer than surviving. Back in Dallas, Donelson spent 17 days on a ventilator. When it was removed, he was too weak to even sit without support and the breathing tube had taken away his ability to swallow. \"He would try to pick his head up off the pillow and it would lob to the side just like a newborn baby,\" said his wife, Terri Donelson, who for the first time since his hospital admission finally was allowed to connect with her husband through a videoconferencing app. For days after waking up, Donelson had tremendous delirium, a dangerous state of mental confusion and agitation. He didn't know where he was or why, and would try to pull out his IV tubes. Then a bacterial infection hit his lungs. Then one morning, worried that Donelson suddenly was too quiet, his doctor donned what she calls her \"full-helmet, Darth Vader-style mask, which cannot possibly help anyone's delirium,\" and went in to check on him. \"I rubbed his arm,\" Goff recalled, asking him to wake up. \"I said, 'Hey are you OK, are you with me?'\" and Donelson started trying to talk, at first too raspy to understand. Eventually, she made out that he was wishing her a happy Easter. She can only guess he heard the date on TV. Doctor and patient cried together. That was Donelson's turning point. He still wasn't deemed virus-free but physical therapists cautiously spent a little more time helping him gain strength and learn to swallow. His first bite: chocolate pudding. Terri Donelson countered the long periods of isolation by keeping the video app running non-stop, talking to her husband and giving him quizzes to stimulate his memory. \"Little by little, with each day, he gains something new, something else reawakens,\" she said. Finally, on June 19, 90 days after the frantic ambulance ride, Donelson - still weak but recovering - went home. His doctor is humbled by his survival, and anxiously awaiting better science to help guide care as the pandemic continues. \"If you have one patient who leaves a really strong impression on you, you may interpret that patient's experience to be hallmark. Until we have large, population-based studies of actual outcomes, it's really hard to know what's real and what's not real,\" Goff said. ___ Neergaard reported from Alexandria, Va., and Winfield from Rome. AP video journalist Nathan Ellgren contributed to this report. Notifications can be turned off anytime in the browser settings. ", "Dr. Peter Barkett of Kaiser Permanente Silverdale Medical Center said he's not only seeing a spike in cases at his hospital in Kitsap County, but a spike among younger adults. \"There is a significant role for the kind of lax hangouts, the backyard barbecues in the spread of COVID, especially among the age group of whom we are seen the highest numbers, the 20 to 39-year-old age group,\" said Barkett. Barkett said things like social distancing and contact tracing aren't being used all the time by this age bracket. He said one thing he often hears from younger adults is that they continue to socialize to offset the adverse mental health effects isolation can take. \"I don't want to tell anybody to hole up in a basement and to kind of hunker down for the next year or two until COVID goes away, but if you do go outside, and especially if you're around other people, try to do it in a way that's safe,\" he said. Contact tracing for that age group is also proving to be difficult. Kim Steele-Peter, a branch director at Tacoma Pierce County Health Department, said that age range is tough to get a hold of. \"What the case and contact investigators are finding is that when they talk to people in that age range, they're more reluctant to tell us who their close contacts are, they don't want to give up their names,\" said Steele-Peter. Contact-tracing and case investigating have been explained by the Washington Department of Health as a critical step to get the state fully reopened. When someone tests positive for COVID-19, a case investigator contacts them, usually by phone, and asked them a series of questions about who they were with and where they were. From that conversation, contact tracers find the people who might have come into contact with the infected person, lets them know and provides information and test locations. Local health districts are in charge of their own contact tracers, but the majority of the funding for them comes from the national CARES Act. Steele-Peter said they're having a harder time getting younger adults to partake-- whether that's giving away friends' information or simply picking a call from an unknown number. RELATED: What is contact tracing, and how does it work with COVID-19? \"There's usually a reason behind it. It may be that they don't know the person that well or that they didn't really know how to get in touch with them,\" she said. It's not just Pierce County. Skagit County Health Officer Howard Leibrand explained over the phone that while most are willing to discuss who've they've been in contact with, a minority of people that contact tracers call are not, and those typically are younger adults. \"There's a small number of people out there who think it's none of their business,\" he said. During Tuesday's weekly COVID-19 virtual update for Snohomish County, Health Officer Dr. Chris Spitter's had this request regarding contact tracing: \"We do want to remind people that in order for them to do their job and achieve the function of containing and suppressing transmission we need people to answer their phones and respond to the text messages when they receive them.\" Steele-Peter believes the system works. She was a contact tracer in the 1980's during the AIDS epidemic and said she's noticing similar apprehension. What worked then and what needs to happen now from contact tracers is recognizing the reasons why they may be withholding information and educating why it's beneficial. \"You may feel like, there are so many other people out there who could provide this information, that you providing your partner's information is not necessarily that important, but it is and taking the time to explain that for every person out there.\" She said that it's important that folks in the age group between 20-39 understand that they're not being blamed, but that contact tracers want to help. \"Every piece of information that they can give us, every close contact is truly important.\" RELATED: Trump administration reportedly opposes new funding for COVID-19 testing, contact tracing Notifications can be turned off anytime in the browser settings. ", "SEATTLE - Although separated by 142 miles of interstate, at first glance it appears the cities of Vancouver, B.C. and Seattle are quite similar. However, the biggest glaring difference is reflected in the coronavirus numbers. According to BC's Ministry of Health, on July 21, the Vancouver Coastal Health District reported a total of 1,043 with 103 confirmed deaths. King County, on the other hand, reported 13,450 with 638 deaths on July 20. In other words, while BC as a whole has more than two million fewer people than Washington State, we've had nearly 13 times as many positive cases of coronavirus. \"If we had allowed our leaders, our scientists to come out and say what needs to be done and stick to it. We would have saved a lot of lives in the US,\" said Dr. Ali Mokdad, UW's Institute for Health Metrics and Evaluation (IHME). RELATED: Report: More Americans look at moving to Canada as coronavirus surges IHME is an independent health research center that's a part of the University of Washington. Mokdad has made his career studying global health. He said while as a whole, Canadians have done a better job adopting social distancing practices, there are a few key differences worth pointing out. First and foremost, western Washington was essentially caught on its heels as the epicenter of the virus that landed in February. The outbreak ultimately led to the closure of the international border in mid-March. Earlier this month, the Canadian government announced that the U.S./Canadian border closure would be extended through late August. \"We have to put (the number of cases) in context. British Columbia lives in a sea of COVID-19. If you look at the case numbers in Washington state or in Alberta, they would be, I would say, not happy, but pretty happy to have the case numbers we have here,\" said Adrian Dix, British Columbia's Minister of Health. RELATED: Coronavirus updates: Canada, US poised to extend border restrictions to Aug. 21 Notifications can be turned off anytime in the browser settings. ", "SEATAC, Wash. - In its first week of operation, a new machine that screens Sea-Tac Airport passengers for fevers didn't catch any travelers with a high temperature. \"It's been very well received by the public and it's been a really helpful and informative proof of concept,\" Julie Collins, Sea-Tac Airport director of customer experience, said during a meeting with airport management Tuesday. The airport instituted the pilot program about two weeks ago. It's entirely voluntary, but the machine will flag passengers running a temperature over 100.4 degrees. The scanner has screened 6,700 passengers so far and checks about 700 people per day, according to the airport. Although the airport hasn't found any travelers with a high fever yet, Collins said flagged passengers would go through additional medical screening to determine why they have an elevated temperature. Collins said the airport has faced some challenges with the temperature checks, including higher staff demands, keeping passenger traffic flowing efficiently and making sure passengers are removing hats and glasses and looking at the camera. RELATED: American, Southwest end face mask medical exceptions; Delta expands testing The temperature checker is just one of several safety measures the airport implemented during the coronavirus pandemic. Motion censors are being installed to restroom faucets. A new app, which allows travels to purchase food and limit contact with staff, is available for download. Since May 18, face coverings have been required inside the airport. The airport has escalated it's cleaning and disinfecting procedures. Staff spend 5,000 hours a week cleaning and so far the airport has gone through 1,268 gallons of hand sanitizer, 1,394 containers of sanitizer wipes and more than 5,012 ounces of disinfecting spray. During the Tuesday meeting, airport officials said passengers can expect a full-time worker at the TSA checkpoint sanitizing the bins and bowls that get sent through security. Still, the airport is urging people who are sick to stay home. RELATED: Sea-Tac Airport to take passenger temperatures to reduce COVID-19 Passenger traffic is increasing, but travel is still nowhere near where it was in this time last year. Right now, the number of visitors sits near 15,900, which is a 76% decrease compared to 2019. Notifications can be turned off anytime in the browser settings. ", "One of the nation's largest teachers unions is authorizing its members to strike if their schools plan to reopen without proper safety measures in the middle of the global pandemic. The American Federation of Teachers, which represents 1.7 million school employees, issued a resolution on Tuesday saying it will support any local chapter that decides to strike over reopening plans. In providing its blessing, the union is also offering local chapters access to its financial and legal resources as they navigate a return to the classroom. Union officials said they will provide legal support, communications support and staffing to local chapters that vote to strike. Although the measure says strikes should be considered only as a \"last resort,\" it lists conditions the organization wants met for schools to reopen. It says buildings should reopen only in areas with lower virus rates, and only if schools require masks, update ventilation systems and make changes to space students apart. RELATED: CDC releases 'Decision-Making Tool' for parents in school reopening guidance RELATED: Trump says some schools may need to delay reopening in the fall In announcing the measure, the union's president blasted President Donald Trump for pressuring schools to reopen even as the virus continues to surge. Randi Weingarten called Trump's response \"chaotic and catastrophic,\" saying it has left teachers afraid. \"We will fight on all fronts for the safety of our students and their educators,\" Weingarten said. \"But if authorities don't protect the safety and health of those we represent and those we serve, as our executive council voted last week, nothing is off the table.\" The union's leaders approved the resolution Friday but announced it Tuesday at the group's convention, which is being hosted online amid the pandemic. The nation's largest teachers union, the National Education Association, separately said its members will do \"whatever it takes\" to protect students. \"Nobody wants to see students back in the classroom more than educators, but when it comes to their safety, we're not ready to take any options off the table,\" the group's president, Lily Eskelsen García, said in a statement. For weeks, Trump has pressed for a full reopening of the nation's schools. Last week he acknowledged that some schools may need to delay a return to in-person instruction, but he's still asking Congress to withhold future virus relief to schools that fail to reopen. Some of the nation's largest public school districts are starting the school year online, including in Los Angeles, Atlanta and Houston. The Chicago Teachers Union, which has clashed with the city over its school reopening plan, said on Tuesday that it isn't ruling out a work stoppage. \"It's long past time for our nation's educators to come together and fight collectively for the common good - up to and including striking to ameliorate the social and economic inequalities at the root of the consequences of this insidious virus,\" the union's vice president, Stacy Davis Gates, said in a statement. Davis Gates said any safety strike would include broader demands to support front-line workers, to provide broadband access to every student, to ensure universal health care and to get \"a hard commitment from public officials to protect Black and Brown lives, whose neighborhoods are disproportionately bearing the burden of death and illness from COVID-19.\" In Massachusetts, nurses represented by the Boston Teachers Union are planning a sit-in at City Hall on Wednesday over the city's reopening plan. The nurses are calling for rapid testing in schools to identify COVID-19, the disease caused by the coronavirus. They also want more protective equipment for nurses and teachers and assessments of air quality in school buildings, among other measures. In Ohio's largest district, about 2,700 Columbus City Schools educators had previously signed a letter calling on leaders to start the fall term online, with the union arguing that the stakes \"are too high for experiments.\" They got their wish Tuesday as the district announced it will start the year with virtual learning for all students in pre-kindergarten through 12th grade. For other districts planning to reopen, the federation's safety demands could be difficult to meet. The union says schools should open only in areas where the infection rate among those tested for the disease caused by the coronavirus, COVID-19, is below 5%, and where the transmission rate is below 1%. It also says local authorities must have plans to close schools if cases spike. Along with mask requirements, the union is also pushing schools to keep people 6 feet apart, to keep buildings and buses clean, and to make accommodations for teachers at greater risk of health problems if they contract COVID-19. For many schools, more funding will be needed to reopen safely, the union said. It estimates the average school will need at least $1.2 million, amounting to $116 billion nationwide. The resolution says Trump and Senate Republicans have \"have failed to negotiate and pass a new stimulus bill to address the resources vitally needed for reopening our schools.\" The latest stimulus proposal from the White House and Senate Republicans includes $105 billion for schools and colleges, though some of the money is only for schools that reopen for in-person classes. In May, the Democratic-led House included $100 billion for schools - none of it limited to those holding on-site classes - but House Speaker Nancy Pelosi has said even more money is needed. In her speech, Weingarten said teachers want schools to reopen. Children need in-person instruction, she said, adding that remote instruction is \"no substitute for it.\" But she said teachers need to know they'll be kept safe. Before Trump began pressing schools to reopen, she said, a union poll found that its members were comfortable returning if proper safeguards were in place. \"Now they're afraid and angry,\" she said. \"Many are quitting, retiring or writing their wills.\" Along with strikes, the union said it will fight unsafe reopening plans through lawsuits and labor grievances. The union's Florida chapter filed a lawsuit last week attempting to block the state's plan to reopen schools, which the suit called \"reckless and unsafe.\" Notifications can be turned off anytime in the browser settings. "]